espressif/arduino-esp32/boards.txt
tinys2.menu.EraseFlash.none=Disabled
tinys2.menu.EraseFlash.none.upload.erase_cmd=
tinys2.menu.EraseFlash.all=Enabled
tinys2.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
rmp.name=UM RMP
rmp.vid.0=0x303a
rmp.pid.0=0x80F6

rmp.upload.tool=esptool_py
rmp.upload.maximum_size=1310720
rmp.upload.maximum_data_size=327680
rmp.upload.flags=
rmp.upload.extra_flags=
rmp.upload.use_1200bps_touch=true
rmp.upload.wait_for_upload_port=true

rmp.serial.disableDTR=false
rmp.serial.disableRTS=false

rmp.build.tarch=xtensa
rmp.build.bootloader_addr=0x1000
rmp.build.target=esp32s2
rmp.build.mcu=esp32s2
rmp.build.core=esp32
rmp.build.variant=um_rmp
rmp.build.board=RMP

rmp.build.cdc_on_boot=1
rmp.build.msc_on_boot=0
rmp.build.dfu_on_boot=0
rmp.build.f_cpu=240000000L
rmp.build.flash_size=4MB
rmp.build.flash_freq=80m
rmp.build.flash_mode=dio
rmp.build.boot=qio
rmp.build.partitions=default
rmp.build.defines=

rmp.menu.CDCOnBoot.cdc=Enabled
rmp.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
rmp.menu.CDCOnBoot.default=Disabled
rmp.menu.CDCOnBoot.default.build.cdc_on_boot=0

rmp.menu.MSCOnBoot.default=Disabled
rmp.menu.MSCOnBoot.default.build.msc_on_boot=0
rmp.menu.MSCOnBoot.msc=Enabled
rmp.menu.MSCOnBoot.msc.build.msc_on_boot=1

rmp.menu.DFUOnBoot.default=Disabled
rmp.menu.DFUOnBoot.default.build.dfu_on_boot=0
rmp.menu.DFUOnBoot.dfu=Enabled
rmp.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

rmp.menu.PSRAM.enabled=Enabled
rmp.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
rmp.menu.PSRAM.disabled=Disabled
rmp.menu.PSRAM.disabled.build.defines=

rmp.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
rmp.menu.PartitionScheme.default.build.partitions=default
rmp.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
rmp.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
rmp.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
rmp.menu.PartitionScheme.minimal.build.partitions=minimal
rmp.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
rmp.menu.PartitionScheme.no_ota.build.partitions=no_ota
rmp.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
rmp.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
rmp.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
rmp.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
rmp.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
rmp.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
rmp.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
rmp.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
rmp.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
rmp.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
rmp.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
rmp.menu.PartitionScheme.huge_app.build.partitions=huge_app
rmp.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
rmp.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
rmp.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
rmp.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

rmp.menu.CPUFreq.240=240MHz (WiFi)
rmp.menu.CPUFreq.240.build.f_cpu=240000000L
rmp.menu.CPUFreq.160=160MHz (WiFi)
rmp.menu.CPUFreq.160.build.f_cpu=160000000L
rmp.menu.CPUFreq.80=80MHz (WiFi)
rmp.menu.CPUFreq.80.build.f_cpu=80000000L
rmp.menu.CPUFreq.40=40MHz
rmp.menu.CPUFreq.40.build.f_cpu=40000000L
rmp.menu.CPUFreq.20=20MHz
rmp.menu.CPUFreq.20.build.f_cpu=20000000L
rmp.menu.CPUFreq.10=10MHz
rmp.menu.CPUFreq.10.build.f_cpu=10000000L

rmp.menu.FlashSize.4M=4MB (32Mb)
rmp.menu.FlashSize.4M.build.flash_size=4MB
rmp.menu.FlashSize.2M=2MB (16Mb)
rmp.menu.FlashSize.2M.build.flash_size=2MB
rmp.menu.FlashSize.2M.build.partitions=minimal

rmp.menu.UploadSpeed.921600=921600
rmp.menu.UploadSpeed.921600.upload.speed=921600
rmp.menu.UploadSpeed.115200=115200
rmp.menu.UploadSpeed.115200.upload.speed=115200
rmp.menu.UploadSpeed.256000.windows=256000
rmp.menu.UploadSpeed.256000.upload.speed=256000
rmp.menu.UploadSpeed.230400.windows.upload.speed=256000
rmp.menu.UploadSpeed.230400=230400
rmp.menu.UploadSpeed.230400.upload.speed=230400
rmp.menu.UploadSpeed.460800.linux=460800
rmp.menu.UploadSpeed.460800.macosx=460800
rmp.menu.UploadSpeed.460800.upload.speed=460800

rmp.menu.DebugLevel.none=None
rmp.menu.DebugLevel.none.build.code_debug=0
rmp.menu.DebugLevel.error=Error
rmp.menu.DebugLevel.error.build.code_debug=1
rmp.menu.DebugLevel.warn=Warn
rmp.menu.DebugLevel.warn.build.code_debug=2
rmp.menu.DebugLevel.info=Info
rmp.menu.DebugLevel.info.build.code_debug=3
rmp.menu.DebugLevel.debug=Debug
rmp.menu.DebugLevel.debug.build.code_debug=4
rmp.menu.DebugLevel.verbose=Verbose
rmp.menu.DebugLevel.verbose.build.code_debug=5

rmp.menu.EraseFlash.none=Disabled
rmp.menu.EraseFlash.none.upload.erase_cmd=
rmp.menu.EraseFlash.all=Enabled
rmp.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
tinys3.name=UM TinyS3
tinys3.vid.0=0x303a
tinys3.pid.0=0x80D0

tinys3.bootloader.tool=esptool_py
tinys3.bootloader.tool.default=esptool_py

tinys3.upload.tool=esptool_py
tinys3.upload.tool.default=esptool_py
tinys3.upload.tool.network=esp_ota

tinys3.upload.maximum_size=1310720
tinys3.upload.maximum_data_size=327680
tinys3.upload.flags=
tinys3.upload.extra_flags=
tinys3.upload.use_1200bps_touch=false
tinys3.upload.wait_for_upload_port=false

tinys3.serial.disableDTR=false
tinys3.serial.disableRTS=false

tinys3.build.tarch=xtensa
tinys3.build.bootloader_addr=0x0
tinys3.build.target=esp32s3
tinys3.build.mcu=esp32s3
tinys3.build.core=esp32
tinys3.build.variant=um_tinys3
tinys3.build.board=TINYS3

tinys3.build.usb_mode=1
tinys3.build.cdc_on_boot=0
tinys3.build.msc_on_boot=0
tinys3.build.dfu_on_boot=0
tinys3.build.f_cpu=240000000L
tinys3.build.flash_size=8MB
tinys3.build.flash_freq=80m
tinys3.build.flash_mode=dio
tinys3.build.boot=qio
tinys3.build.partitions=default
tinys3.build.defines=
tinys3.build.loop_core=
tinys3.build.event_core=
tinys3.build.flash_type=qio
tinys3.build.psram_type=qspi
tinys3.build.memory_type=qio_qspi

tinys3.menu.LoopCore.1=Core 1
tinys3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
tinys3.menu.LoopCore.0=Core 0
tinys3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

tinys3.menu.EventsCore.1=Core 1
tinys3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
tinys3.menu.EventsCore.0=Core 0
tinys3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

tinys3.menu.USBMode.default=USB-OTG (TinyUSB)
tinys3.menu.USBMode.default.build.usb_mode=0
tinys3.menu.USBMode.hwcdc=Hardware CDC and JTAG
tinys3.menu.USBMode.hwcdc.build.usb_mode=1

