espressif/arduino-esp32/boards.txt
micros2.menu.FlashSize.16M=16MB (128Mb)
micros2.menu.FlashSize.16M.build.flash_size=16MB
micros2.menu.FlashSize.4M=4MB (32Mb)
micros2.menu.FlashSize.4M.build.flash_size=4MB
micros2.menu.FlashSize.8M=8MB (64Mb)
micros2.menu.FlashSize.8M.build.flash_size=8MB
micros2.menu.FlashSize.8M.build.partitions=default_8MB
micros2.menu.FlashSize.2M=2MB (16Mb)
micros2.menu.FlashSize.2M.build.flash_size=2MB
micros2.menu.FlashSize.2M.build.partitions=minimal

micros2.menu.UploadSpeed.921600=921600
micros2.menu.UploadSpeed.921600.upload.speed=921600
micros2.menu.UploadSpeed.115200=115200
micros2.menu.UploadSpeed.115200.upload.speed=115200
micros2.menu.UploadSpeed.256000.windows=256000
micros2.menu.UploadSpeed.256000.upload.speed=256000
micros2.menu.UploadSpeed.230400.windows.upload.speed=256000
micros2.menu.UploadSpeed.230400=230400
micros2.menu.UploadSpeed.230400.upload.speed=230400
micros2.menu.UploadSpeed.460800.linux=460800
micros2.menu.UploadSpeed.460800.macosx=460800
micros2.menu.UploadSpeed.460800.upload.speed=460800

micros2.menu.DebugLevel.none=None
micros2.menu.DebugLevel.none.build.code_debug=0
micros2.menu.DebugLevel.error=Error
micros2.menu.DebugLevel.error.build.code_debug=1
micros2.menu.DebugLevel.warn=Warn
micros2.menu.DebugLevel.warn.build.code_debug=2
micros2.menu.DebugLevel.info=Info
micros2.menu.DebugLevel.info.build.code_debug=3
micros2.menu.DebugLevel.debug=Debug
micros2.menu.DebugLevel.debug.build.code_debug=4
micros2.menu.DebugLevel.verbose=Verbose
micros2.menu.DebugLevel.verbose.build.code_debug=5

micros2.menu.EraseFlash.none=Disabled
micros2.menu.EraseFlash.none.upload.erase_cmd=
micros2.menu.EraseFlash.all=Enabled
micros2.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

magicbit.name=MagicBit

magicbit.bootloader.tool=esptool_py
magicbit.bootloader.tool.default=esptool_py

magicbit.upload.tool=esptool_py
magicbit.upload.tool.default=esptool_py
magicbit.upload.tool.network=esp_ota

magicbit.upload.maximum_size=1310720
magicbit.upload.maximum_data_size=327680
magicbit.upload.flags=
magicbit.upload.extra_flags=

magicbit.serial.disableDTR=true
magicbit.serial.disableRTS=true

magicbit.build.tarch=xtensa
magicbit.build.bootloader_addr=0x1000
magicbit.build.target=esp32
magicbit.build.mcu=esp32
magicbit.build.core=esp32
magicbit.build.variant=magicbit
magicbit.build.board=ESP32_DEV

magicbit.build.f_cpu=240000000L
magicbit.build.flash_size=4MB
magicbit.build.flash_freq=40m
magicbit.build.flash_mode=dio
magicbit.build.boot=dio
magicbit.build.partitions=default

magicbit.menu.CPUFreq.240=240MHz (WiFi/BT)
magicbit.menu.CPUFreq.240.build.f_cpu=240000000L
magicbit.menu.CPUFreq.160=160MHz (WiFi/BT)
magicbit.menu.CPUFreq.160.build.f_cpu=160000000L
magicbit.menu.CPUFreq.80=80MHz (WiFi/BT)
magicbit.menu.CPUFreq.80.build.f_cpu=80000000L
magicbit.menu.CPUFreq.40=40MHz (40MHz XTAL)

magicbit.menu.UploadSpeed.921600=921600
magicbit.menu.UploadSpeed.921600.upload.speed=921600
magicbit.menu.UploadSpeed.115200=115200
magicbit.menu.UploadSpeed.115200.upload.speed=115200

magicbit.menu.DebugLevel.none=None
magicbit.menu.DebugLevel.none.build.code_debug=0
magicbit.menu.DebugLevel.error=Error
magicbit.menu.DebugLevel.error.build.code_debug=1
magicbit.menu.DebugLevel.warn=Warn
magicbit.menu.DebugLevel.warn.build.code_debug=2
magicbit.menu.DebugLevel.info=Info
magicbit.menu.DebugLevel.info.build.code_debug=3
magicbit.menu.DebugLevel.debug=Debug
magicbit.menu.DebugLevel.debug.build.code_debug=4
magicbit.menu.DebugLevel.verbose=Verbose
magicbit.menu.DebugLevel.verbose.build.code_debug=5

magicbit.menu.EraseFlash.none=Disabled
magicbit.menu.EraseFlash.none.upload.erase_cmd=
magicbit.menu.EraseFlash.all=Enabled
magicbit.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

turta_iot_node.name=Turta IoT Node

turta_iot_node.bootloader.tool=esptool_py
turta_iot_node.bootloader.tool.default=esptool_py

turta_iot_node.upload.tool=esptool_py
turta_iot_node.upload.tool.default=esptool_py
turta_iot_node.upload.tool.network=esp_ota

turta_iot_node.upload.maximum_size=1310720
turta_iot_node.upload.maximum_data_size=327680
turta_iot_node.upload.flags=
turta_iot_node.upload.extra_flags=

turta_iot_node.serial.disableDTR=true
turta_iot_node.serial.disableRTS=true

turta_iot_node.build.tarch=xtensa
turta_iot_node.build.bootloader_addr=0x1000
turta_iot_node.build.target=esp32
turta_iot_node.build.mcu=esp32
turta_iot_node.build.core=esp32
turta_iot_node.build.variant=pico32
turta_iot_node.build.board=ESP32_PICO

turta_iot_node.build.f_cpu=240000000L
turta_iot_node.build.flash_size=4MB
turta_iot_node.build.flash_freq=80m
turta_iot_node.build.flash_mode=dio
turta_iot_node.build.boot=dio
turta_iot_node.build.partitions=default
turta_iot_node.build.defines=

turta_iot_node.menu.UploadSpeed.921600=921600
turta_iot_node.menu.UploadSpeed.921600.upload.speed=921600
turta_iot_node.menu.UploadSpeed.115200=115200
turta_iot_node.menu.UploadSpeed.115200.upload.speed=115200

turta_iot_node.menu.DebugLevel.none=None
turta_iot_node.menu.DebugLevel.none.build.code_debug=0
turta_iot_node.menu.DebugLevel.error=Error
turta_iot_node.menu.DebugLevel.error.build.code_debug=1
turta_iot_node.menu.DebugLevel.warn=Warn
turta_iot_node.menu.DebugLevel.warn.build.code_debug=2
turta_iot_node.menu.DebugLevel.info=Info
turta_iot_node.menu.DebugLevel.info.build.code_debug=3
turta_iot_node.menu.DebugLevel.debug=Debug
turta_iot_node.menu.DebugLevel.debug.build.code_debug=4
turta_iot_node.menu.DebugLevel.verbose=Verbose
turta_iot_node.menu.DebugLevel.verbose.build.code_debug=5

turta_iot_node.menu.EraseFlash.none=Disabled
turta_iot_node.menu.EraseFlash.none.upload.erase_cmd=
turta_iot_node.menu.EraseFlash.all=Enabled
turta_iot_node.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

ttgo-lora32.name=TTGO LoRa32-OLED

ttgo-lora32.bootloader.tool=esptool_py
ttgo-lora32.bootloader.tool.default=esptool_py

