espressif/arduino-esp32/boards.txt
dfrobot_beetle_esp32c3.menu.CPUFreq.160=160MHz (WiFi)
dfrobot_beetle_esp32c3.menu.CPUFreq.160.build.f_cpu=160000000L
dfrobot_beetle_esp32c3.menu.CPUFreq.80=80MHz (WiFi)
dfrobot_beetle_esp32c3.menu.CPUFreq.80.build.f_cpu=80000000L
dfrobot_beetle_esp32c3.menu.CPUFreq.40=40MHz
dfrobot_beetle_esp32c3.menu.CPUFreq.40.build.f_cpu=40000000L
dfrobot_beetle_esp32c3.menu.CPUFreq.20=20MHz
dfrobot_beetle_esp32c3.menu.CPUFreq.20.build.f_cpu=20000000L
dfrobot_beetle_esp32c3.menu.CPUFreq.10=10MHz
dfrobot_beetle_esp32c3.menu.CPUFreq.10.build.f_cpu=10000000L

dfrobot_beetle_esp32c3.menu.FlashMode.qio=QIO
dfrobot_beetle_esp32c3.menu.FlashMode.qio.build.flash_mode=dio
dfrobot_beetle_esp32c3.menu.FlashMode.qio.build.boot=qio
dfrobot_beetle_esp32c3.menu.FlashMode.dio=DIO
dfrobot_beetle_esp32c3.menu.FlashMode.dio.build.flash_mode=dio
dfrobot_beetle_esp32c3.menu.FlashMode.dio.build.boot=dio
dfrobot_beetle_esp32c3.menu.FlashMode.qout=QOUT
dfrobot_beetle_esp32c3.menu.FlashMode.qout.build.flash_mode=dout
dfrobot_beetle_esp32c3.menu.FlashMode.qout.build.boot=qout
dfrobot_beetle_esp32c3.menu.FlashMode.dout=DOUT
dfrobot_beetle_esp32c3.menu.FlashMode.dout.build.flash_mode=dout
dfrobot_beetle_esp32c3.menu.FlashMode.dout.build.boot=dout

dfrobot_beetle_esp32c3.menu.FlashFreq.80=80MHz
dfrobot_beetle_esp32c3.menu.FlashFreq.80.build.flash_freq=80m
dfrobot_beetle_esp32c3.menu.FlashFreq.40=40MHz
dfrobot_beetle_esp32c3.menu.FlashFreq.40.build.flash_freq=40m

dfrobot_beetle_esp32c3.menu.FlashSize.4M=4MB (32Mb)
dfrobot_beetle_esp32c3.menu.FlashSize.4M.build.flash_size=4MB

dfrobot_beetle_esp32c3.menu.UploadSpeed.921600=921600
dfrobot_beetle_esp32c3.menu.UploadSpeed.921600.upload.speed=921600
dfrobot_beetle_esp32c3.menu.UploadSpeed.115200=115200
dfrobot_beetle_esp32c3.menu.UploadSpeed.115200.upload.speed=115200
dfrobot_beetle_esp32c3.menu.UploadSpeed.256000.windows=256000
dfrobot_beetle_esp32c3.menu.UploadSpeed.256000.upload.speed=256000
dfrobot_beetle_esp32c3.menu.UploadSpeed.230400.windows.upload.speed=256000
dfrobot_beetle_esp32c3.menu.UploadSpeed.230400=230400
dfrobot_beetle_esp32c3.menu.UploadSpeed.230400.upload.speed=230400
dfrobot_beetle_esp32c3.menu.UploadSpeed.460800.linux=460800
dfrobot_beetle_esp32c3.menu.UploadSpeed.460800.macosx=460800
dfrobot_beetle_esp32c3.menu.UploadSpeed.460800.upload.speed=460800
dfrobot_beetle_esp32c3.menu.UploadSpeed.512000.windows=512000
dfrobot_beetle_esp32c3.menu.UploadSpeed.512000.upload.speed=512000

dfrobot_beetle_esp32c3.menu.DebugLevel.none=None
dfrobot_beetle_esp32c3.menu.DebugLevel.none.build.code_debug=0
dfrobot_beetle_esp32c3.menu.DebugLevel.error=Error
dfrobot_beetle_esp32c3.menu.DebugLevel.error.build.code_debug=1
dfrobot_beetle_esp32c3.menu.DebugLevel.warn=Warn
dfrobot_beetle_esp32c3.menu.DebugLevel.warn.build.code_debug=2
dfrobot_beetle_esp32c3.menu.DebugLevel.info=Info
dfrobot_beetle_esp32c3.menu.DebugLevel.info.build.code_debug=3
dfrobot_beetle_esp32c3.menu.DebugLevel.debug=Debug
dfrobot_beetle_esp32c3.menu.DebugLevel.debug.build.code_debug=4
dfrobot_beetle_esp32c3.menu.DebugLevel.verbose=Verbose
dfrobot_beetle_esp32c3.menu.DebugLevel.verbose.build.code_debug=5

dfrobot_beetle_esp32c3.menu.EraseFlash.none=Disabled
dfrobot_beetle_esp32c3.menu.EraseFlash.none.upload.erase_cmd=
dfrobot_beetle_esp32c3.menu.EraseFlash.all=Enabled
dfrobot_beetle_esp32c3.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

dfrobot_firebeetle2_esp32s3.name=DFRobot Firebeetle 2 ESP32-S3
#dfrobot_firebeetle2_esp32s3.vid.0=0x3343
#dfrobot_firebeetle2_esp32s3.pid.0=0x83CF
dfrobot_beetle_esp32c3.vid.0=0x303a
dfrobot_beetle_esp32c3.pid.0=0x1001

dfrobot_firebeetle2_esp32s3.bootloader.tool=esptool_py
dfrobot_firebeetle2_esp32s3.bootloader.tool.default=esptool_py

dfrobot_firebeetle2_esp32s3.upload.tool=esptool_py
dfrobot_firebeetle2_esp32s3.upload.tool.default=esptool_py
dfrobot_firebeetle2_esp32s3.upload.tool.network=esp_ota

dfrobot_firebeetle2_esp32s3.upload.maximum_size=1310720
dfrobot_firebeetle2_esp32s3.upload.maximum_data_size=327680
dfrobot_firebeetle2_esp32s3.upload.flags=
dfrobot_firebeetle2_esp32s3.upload.extra_flags=
dfrobot_firebeetle2_esp32s3.upload.use_1200bps_touch=false
dfrobot_firebeetle2_esp32s3.upload.wait_for_upload_port=false

dfrobot_firebeetle2_esp32s3.serial.disableDTR=false
dfrobot_firebeetle2_esp32s3.serial.disableRTS=false

dfrobot_firebeetle2_esp32s3.build.tarch=xtensa
dfrobot_firebeetle2_esp32s3.build.bootloader_addr=0x0
dfrobot_firebeetle2_esp32s3.build.target=esp32s3
dfrobot_firebeetle2_esp32s3.build.mcu=esp32s3
dfrobot_firebeetle2_esp32s3.build.core=esp32
dfrobot_firebeetle2_esp32s3.build.variant=dfrobot_firebeetle2_esp32s3
dfrobot_firebeetle2_esp32s3.build.board=ESP32S3_DEV
#dfrobot_firebeetle2_esp32s3.build.board=DFROBOT_FIREBEETLE_2_ESP32S3

dfrobot_firebeetle2_esp32s3.build.usb_mode=1
dfrobot_firebeetle2_esp32s3.build.cdc_on_boot=0
dfrobot_firebeetle2_esp32s3.build.msc_on_boot=0
dfrobot_firebeetle2_esp32s3.build.dfu_on_boot=0
dfrobot_firebeetle2_esp32s3.build.f_cpu=240000000L
dfrobot_firebeetle2_esp32s3.build.flash_size=4MB
dfrobot_firebeetle2_esp32s3.build.flash_freq=80m
dfrobot_firebeetle2_esp32s3.build.flash_mode=dio
dfrobot_firebeetle2_esp32s3.build.boot=qio
dfrobot_firebeetle2_esp32s3.build.boot_freq=80m
dfrobot_firebeetle2_esp32s3.build.partitions=default
dfrobot_firebeetle2_esp32s3.build.defines=
dfrobot_firebeetle2_esp32s3.build.loop_core=
dfrobot_firebeetle2_esp32s3.build.event_core=
dfrobot_firebeetle2_esp32s3.build.flash_type=qio
dfrobot_firebeetle2_esp32s3.build.psram_type=qspi
dfrobot_firebeetle2_esp32s3.build.memory_type={build.flash_type}_{build.psram_type}

dfrobot_firebeetle2_esp32s3.menu.PSRAM.disabled=Disabled
dfrobot_firebeetle2_esp32s3.menu.PSRAM.disabled.build.defines=
dfrobot_firebeetle2_esp32s3.menu.PSRAM.disabled.build.psram_type=qspi
dfrobot_firebeetle2_esp32s3.menu.PSRAM.enabled=QSPI PSRAM
dfrobot_firebeetle2_esp32s3.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
dfrobot_firebeetle2_esp32s3.menu.PSRAM.enabled.build.psram_type=qspi
dfrobot_firebeetle2_esp32s3.menu.PSRAM.opi=OPI PSRAM
dfrobot_firebeetle2_esp32s3.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
dfrobot_firebeetle2_esp32s3.menu.PSRAM.opi.build.psram_type=opi

dfrobot_firebeetle2_esp32s3.menu.FlashMode.qio=QIO 80MHz
dfrobot_firebeetle2_esp32s3.menu.FlashMode.qio.build.flash_mode=dio
dfrobot_firebeetle2_esp32s3.menu.FlashMode.qio.build.boot=qio
dfrobot_firebeetle2_esp32s3.menu.FlashMode.qio.build.boot_freq=80m
dfrobot_firebeetle2_esp32s3.menu.FlashMode.qio.build.flash_freq=80m
dfrobot_firebeetle2_esp32s3.menu.FlashMode.qio.build.flash_type=qio
dfrobot_firebeetle2_esp32s3.menu.FlashMode.qio120=QIO 120MHz
dfrobot_firebeetle2_esp32s3.menu.FlashMode.qio120.build.flash_mode=dio
dfrobot_firebeetle2_esp32s3.menu.FlashMode.qio120.build.boot=qio
dfrobot_firebeetle2_esp32s3.menu.FlashMode.qio120.build.boot_freq=120m
dfrobot_firebeetle2_esp32s3.menu.FlashMode.qio120.build.flash_freq=80m
dfrobot_firebeetle2_esp32s3.menu.FlashMode.qio120.build.flash_type=qio
dfrobot_firebeetle2_esp32s3.menu.FlashMode.dio=DIO 80MHz
dfrobot_firebeetle2_esp32s3.menu.FlashMode.dio.build.flash_mode=dio
dfrobot_firebeetle2_esp32s3.menu.FlashMode.dio.build.boot=dio
dfrobot_firebeetle2_esp32s3.menu.FlashMode.dio.build.boot_freq=80m
dfrobot_firebeetle2_esp32s3.menu.FlashMode.dio.build.flash_freq=80m
dfrobot_firebeetle2_esp32s3.menu.FlashMode.dio.build.flash_type=qio
dfrobot_firebeetle2_esp32s3.menu.FlashMode.opi=OPI 80MHz
dfrobot_firebeetle2_esp32s3.menu.FlashMode.opi.build.flash_mode=dout
dfrobot_firebeetle2_esp32s3.menu.FlashMode.opi.build.boot=opi
dfrobot_firebeetle2_esp32s3.menu.FlashMode.opi.build.boot_freq=80m
dfrobot_firebeetle2_esp32s3.menu.FlashMode.opi.build.flash_freq=80m
dfrobot_firebeetle2_esp32s3.menu.FlashMode.opi.build.flash_type=opi

