espressif/arduino-esp32/boards.txt
featheresp32.menu.CPUFreq.240=240MHz (WiFi/BT)
featheresp32.menu.CPUFreq.240.build.f_cpu=240000000L
featheresp32.menu.CPUFreq.160=160MHz (WiFi/BT)
featheresp32.menu.CPUFreq.160.build.f_cpu=160000000L
featheresp32.menu.CPUFreq.80=80MHz (WiFi/BT)
featheresp32.menu.CPUFreq.80.build.f_cpu=80000000L
featheresp32.menu.CPUFreq.40=40MHz
featheresp32.menu.CPUFreq.40.build.f_cpu=40000000L
featheresp32.menu.CPUFreq.20=20MHz
featheresp32.menu.CPUFreq.20.build.f_cpu=20000000L
featheresp32.menu.CPUFreq.10=10MHz
featheresp32.menu.CPUFreq.10.build.f_cpu=10000000L

featheresp32.menu.FlashFreq.80=80MHz
featheresp32.menu.FlashFreq.80.build.flash_freq=80m
featheresp32.menu.FlashFreq.40=40MHz
featheresp32.menu.FlashFreq.40.build.flash_freq=40m

featheresp32.menu.FlashSize.4M=4MB (32Mb)
featheresp32.menu.FlashSize.4M.build.flash_size=4MB

featheresp32.menu.UploadSpeed.921600=921600
featheresp32.menu.UploadSpeed.921600.upload.speed=921600
featheresp32.menu.UploadSpeed.115200=115200
featheresp32.menu.UploadSpeed.115200.upload.speed=115200
featheresp32.menu.UploadSpeed.256000.windows=256000
featheresp32.menu.UploadSpeed.256000.upload.speed=256000
featheresp32.menu.UploadSpeed.230400.windows.upload.speed=256000
featheresp32.menu.UploadSpeed.230400=230400
featheresp32.menu.UploadSpeed.230400.upload.speed=230400
featheresp32.menu.UploadSpeed.460800.linux=460800
featheresp32.menu.UploadSpeed.460800.macosx=460800
featheresp32.menu.UploadSpeed.460800.upload.speed=460800
featheresp32.menu.UploadSpeed.512000.windows=512000
featheresp32.menu.UploadSpeed.512000.upload.speed=512000

featheresp32.menu.DebugLevel.none=None
featheresp32.menu.DebugLevel.none.build.code_debug=0
featheresp32.menu.DebugLevel.error=Error
featheresp32.menu.DebugLevel.error.build.code_debug=1
featheresp32.menu.DebugLevel.warn=Warn
featheresp32.menu.DebugLevel.warn.build.code_debug=2
featheresp32.menu.DebugLevel.info=Info
featheresp32.menu.DebugLevel.info.build.code_debug=3
featheresp32.menu.DebugLevel.debug=Debug
featheresp32.menu.DebugLevel.debug.build.code_debug=4
featheresp32.menu.DebugLevel.verbose=Verbose
featheresp32.menu.DebugLevel.verbose.build.code_debug=5

featheresp32.menu.EraseFlash.none=Disabled
featheresp32.menu.EraseFlash.none.upload.erase_cmd=
featheresp32.menu.EraseFlash.all=Enabled
featheresp32.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
# Adafruit Metro ESP32-S2

adafruit_metro_esp32s2.name=Adafruit Metro ESP32-S2
adafruit_metro_esp32s2.vid.0=0x239A
adafruit_metro_esp32s2.pid.0=0x80DF
adafruit_metro_esp32s2.vid.1=0x239A
adafruit_metro_esp32s2.pid.1=0x00DF
adafruit_metro_esp32s2.vid.2=0x239A
adafruit_metro_esp32s2.pid.2=0x80E0

adafruit_metro_esp32s2.bootloader.tool=esptool_py
adafruit_metro_esp32s2.bootloader.tool.default=esptool_py

adafruit_metro_esp32s2.upload.tool=esptool_py
adafruit_metro_esp32s2.upload.tool.default=esptool_py
adafruit_metro_esp32s2.upload.tool.network=esp_ota

adafruit_metro_esp32s2.upload.maximum_size=1310720
adafruit_metro_esp32s2.upload.maximum_data_size=327680
adafruit_metro_esp32s2.upload.flags=
adafruit_metro_esp32s2.upload.extra_flags=
adafruit_metro_esp32s2.upload.use_1200bps_touch=true
adafruit_metro_esp32s2.upload.wait_for_upload_port=true

adafruit_metro_esp32s2.serial.disableDTR=false
adafruit_metro_esp32s2.serial.disableRTS=false

adafruit_metro_esp32s2.build.tarch=xtensa
adafruit_metro_esp32s2.build.bootloader_addr=0x1000
adafruit_metro_esp32s2.build.target=esp32s2
adafruit_metro_esp32s2.build.mcu=esp32s2
adafruit_metro_esp32s2.build.core=esp32
adafruit_metro_esp32s2.build.variant=adafruit_metro_esp32s2
adafruit_metro_esp32s2.build.board=METRO_ESP32S2

adafruit_metro_esp32s2.build.cdc_on_boot=1
adafruit_metro_esp32s2.build.msc_on_boot=0
adafruit_metro_esp32s2.build.dfu_on_boot=0
adafruit_metro_esp32s2.build.f_cpu=240000000L
adafruit_metro_esp32s2.build.flash_size=4MB
adafruit_metro_esp32s2.build.flash_freq=80m
adafruit_metro_esp32s2.build.flash_mode=dio
adafruit_metro_esp32s2.build.boot=qio
adafruit_metro_esp32s2.build.partitions=default
adafruit_metro_esp32s2.build.defines=

adafruit_metro_esp32s2.menu.CDCOnBoot.cdc=Enabled
adafruit_metro_esp32s2.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
adafruit_metro_esp32s2.menu.CDCOnBoot.default=Disabled
adafruit_metro_esp32s2.menu.CDCOnBoot.default.build.cdc_on_boot=0

adafruit_metro_esp32s2.menu.MSCOnBoot.default=Disabled
adafruit_metro_esp32s2.menu.MSCOnBoot.default.build.msc_on_boot=0
adafruit_metro_esp32s2.menu.MSCOnBoot.msc=Enabled
adafruit_metro_esp32s2.menu.MSCOnBoot.msc.build.msc_on_boot=1

adafruit_metro_esp32s2.menu.DFUOnBoot.default=Disabled
adafruit_metro_esp32s2.menu.DFUOnBoot.default.build.dfu_on_boot=0
adafruit_metro_esp32s2.menu.DFUOnBoot.dfu=Enabled
adafruit_metro_esp32s2.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

adafruit_metro_esp32s2.menu.UploadMode.cdc=Internal USB
adafruit_metro_esp32s2.menu.UploadMode.cdc.upload.use_1200bps_touch=true
adafruit_metro_esp32s2.menu.UploadMode.cdc.upload.wait_for_upload_port=true
adafruit_metro_esp32s2.menu.UploadMode.default=UART0
adafruit_metro_esp32s2.menu.UploadMode.default.upload.use_1200bps_touch=false
adafruit_metro_esp32s2.menu.UploadMode.default.upload.wait_for_upload_port=false

adafruit_metro_esp32s2.menu.PSRAM.enabled=Enabled
adafruit_metro_esp32s2.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
adafruit_metro_esp32s2.menu.PSRAM.disabled=Disabled
adafruit_metro_esp32s2.menu.PSRAM.disabled.build.defines=

adafruit_metro_esp32s2.menu.PartitionScheme.tinyuf2=TinyUF2 4MB (1.3MB APP/960KB FFAT)
adafruit_metro_esp32s2.menu.PartitionScheme.tinyuf2.build.custom_bootloader=bootloader-tinyuf2
adafruit_metro_esp32s2.menu.PartitionScheme.tinyuf2.build.custom_partitions=partitions-4MB-tinyuf2
adafruit_metro_esp32s2.menu.PartitionScheme.tinyuf2.upload.maximum_size=1441792
adafruit_metro_esp32s2.menu.PartitionScheme.tinyuf2.upload.extra_flags=0x2d0000 "{runtime.platform.path}/variants/{build.variant}/tinyuf2.bin"
adafruit_metro_esp32s2.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
adafruit_metro_esp32s2.menu.PartitionScheme.default.build.partitions=default
adafruit_metro_esp32s2.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
adafruit_metro_esp32s2.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
adafruit_metro_esp32s2.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
adafruit_metro_esp32s2.menu.PartitionScheme.minimal.build.partitions=minimal
adafruit_metro_esp32s2.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
adafruit_metro_esp32s2.menu.PartitionScheme.no_ota.build.partitions=no_ota
adafruit_metro_esp32s2.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
adafruit_metro_esp32s2.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
adafruit_metro_esp32s2.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
adafruit_metro_esp32s2.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
adafruit_metro_esp32s2.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
adafruit_metro_esp32s2.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
adafruit_metro_esp32s2.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
adafruit_metro_esp32s2.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
adafruit_metro_esp32s2.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
adafruit_metro_esp32s2.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
adafruit_metro_esp32s2.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
adafruit_metro_esp32s2.menu.PartitionScheme.huge_app.build.partitions=huge_app
adafruit_metro_esp32s2.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
adafruit_metro_esp32s2.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
adafruit_metro_esp32s2.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
adafruit_metro_esp32s2.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

adafruit_metro_esp32s2.menu.CPUFreq.240=240MHz (WiFi)
adafruit_metro_esp32s2.menu.CPUFreq.240.build.f_cpu=240000000L
adafruit_metro_esp32s2.menu.CPUFreq.160=160MHz (WiFi)
adafruit_metro_esp32s2.menu.CPUFreq.160.build.f_cpu=160000000L
adafruit_metro_esp32s2.menu.CPUFreq.80=80MHz (WiFi)
adafruit_metro_esp32s2.menu.CPUFreq.80.build.f_cpu=80000000L
adafruit_metro_esp32s2.menu.CPUFreq.40=40MHz
adafruit_metro_esp32s2.menu.CPUFreq.40.build.f_cpu=40000000L
adafruit_metro_esp32s2.menu.CPUFreq.20=20MHz
adafruit_metro_esp32s2.menu.CPUFreq.20.build.f_cpu=20000000L
adafruit_metro_esp32s2.menu.CPUFreq.10=10MHz
adafruit_metro_esp32s2.menu.CPUFreq.10.build.f_cpu=10000000L

