espressif/arduino-esp32/boards.txt
##############################################################

metro_esp-32.name=Metro ESP-32

metro_esp-32.bootloader.tool=esptool_py
metro_esp-32.bootloader.tool.default=esptool_py

metro_esp-32.upload.tool=esptool_py
metro_esp-32.upload.tool.default=esptool_py
metro_esp-32.upload.tool.network=esp_ota

metro_esp-32.upload.maximum_size=1310720
metro_esp-32.upload.maximum_data_size=327680
metro_esp-32.upload.flags=
metro_esp-32.upload.extra_flags=

metro_esp-32.serial.disableDTR=true
metro_esp-32.serial.disableRTS=true

metro_esp-32.build.tarch=xtensa
metro_esp-32.build.bootloader_addr=0x1000
metro_esp-32.build.target=esp32
metro_esp-32.build.mcu=esp32
metro_esp-32.build.core=esp32
metro_esp-32.build.variant=metro_esp-32
metro_esp-32.build.board=Metro

metro_esp-32.build.f_cpu=240000000L
metro_esp-32.build.flash_mode=dio
metro_esp-32.build.flash_size=4MB
metro_esp-32.build.boot=dio
metro_esp-32.build.partitions=default
metro_esp-32.build.defines=

metro_esp-32.menu.PartitionScheme.default=Default
metro_esp-32.menu.PartitionScheme.default.build.partitions=default
metro_esp-32.menu.PartitionScheme.no_ota=No OTA (Large APP)
metro_esp-32.menu.PartitionScheme.no_ota.build.partitions=no_ota
metro_esp-32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
metro_esp-32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
metro_esp-32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
metro_esp-32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

metro_esp-32.menu.FlashFreq.80=80MHz
metro_esp-32.menu.FlashFreq.80.build.flash_freq=80m
metro_esp-32.menu.FlashFreq.40=40MHz
metro_esp-32.menu.FlashFreq.40.build.flash_freq=40m

metro_esp-32.menu.UploadSpeed.921600=921600
metro_esp-32.menu.UploadSpeed.921600.upload.speed=921600
metro_esp-32.menu.UploadSpeed.115200=115200
metro_esp-32.menu.UploadSpeed.115200.upload.speed=115200
metro_esp-32.menu.UploadSpeed.256000.windows=256000
metro_esp-32.menu.UploadSpeed.256000.upload.speed=256000
metro_esp-32.menu.UploadSpeed.230400.windows.upload.speed=256000
metro_esp-32.menu.UploadSpeed.230400=230400
metro_esp-32.menu.UploadSpeed.230400.upload.speed=230400
metro_esp-32.menu.UploadSpeed.460800.linux=460800
metro_esp-32.menu.UploadSpeed.460800.macosx=460800
metro_esp-32.menu.UploadSpeed.460800.upload.speed=460800
metro_esp-32.menu.UploadSpeed.512000.windows=512000
metro_esp-32.menu.UploadSpeed.512000.upload.speed=512000

metro_esp-32.menu.DebugLevel.none=None
metro_esp-32.menu.DebugLevel.none.build.code_debug=0
metro_esp-32.menu.DebugLevel.error=Error
metro_esp-32.menu.DebugLevel.error.build.code_debug=1
metro_esp-32.menu.DebugLevel.warn=Warn
metro_esp-32.menu.DebugLevel.warn.build.code_debug=2
metro_esp-32.menu.DebugLevel.info=Info
metro_esp-32.menu.DebugLevel.info.build.code_debug=3
metro_esp-32.menu.DebugLevel.debug=Debug
metro_esp-32.menu.DebugLevel.debug.build.code_debug=4
metro_esp-32.menu.DebugLevel.verbose=Verbose
metro_esp-32.menu.DebugLevel.verbose.build.code_debug=5

metro_esp-32.menu.EraseFlash.none=Disabled
metro_esp-32.menu.EraseFlash.none.upload.erase_cmd=
metro_esp-32.menu.EraseFlash.all=Enabled
metro_esp-32.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

sensesiot_weizen.name=Senses's WEIZEN

sensesiot_weizen.bootloader.tool=esptool_py
sensesiot_weizen.bootloader.tool.default=esptool_py

sensesiot_weizen.upload.tool=esptool_py
sensesiot_weizen.upload.tool.default=esptool_py
sensesiot_weizen.upload.tool.network=esp_ota

sensesiot_weizen.upload.maximum_size=1310720
sensesiot_weizen.upload.maximum_data_size=327680
sensesiot_weizen.upload.flags=
sensesiot_weizen.upload.extra_flags=

sensesiot_weizen.serial.disableDTR=true
sensesiot_weizen.serial.disableRTS=true

sensesiot_weizen.build.tarch=xtensa
sensesiot_weizen.build.bootloader_addr=0x1000
sensesiot_weizen.build.target=esp32
sensesiot_weizen.build.mcu=esp32
sensesiot_weizen.build.core=esp32
sensesiot_weizen.build.variant=esp32
sensesiot_weizen.build.board=sensesiot_weizen

sensesiot_weizen.build.f_cpu=240000000L
sensesiot_weizen.build.flash_mode=dio
sensesiot_weizen.build.flash_size=4MB
sensesiot_weizen.build.boot=dio
sensesiot_weizen.build.partitions=default
sensesiot_weizen.build.defines=

sensesiot_weizen.menu.FlashFreq.80=80MHz
sensesiot_weizen.menu.FlashFreq.80.build.flash_freq=80m
sensesiot_weizen.menu.FlashFreq.40=40MHz
sensesiot_weizen.menu.FlashFreq.40.build.flash_freq=40m

sensesiot_weizen.menu.UploadSpeed.921600=921600
sensesiot_weizen.menu.UploadSpeed.921600.upload.speed=921600
sensesiot_weizen.menu.UploadSpeed.115200=115200
sensesiot_weizen.menu.UploadSpeed.115200.upload.speed=115200
sensesiot_weizen.menu.UploadSpeed.256000.windows=256000
sensesiot_weizen.menu.UploadSpeed.256000.upload.speed=256000
sensesiot_weizen.menu.UploadSpeed.230400.windows.upload.speed=256000
sensesiot_weizen.menu.UploadSpeed.230400=230400
sensesiot_weizen.menu.UploadSpeed.230400.upload.speed=230400
sensesiot_weizen.menu.UploadSpeed.460800.linux=460800
sensesiot_weizen.menu.UploadSpeed.460800.macosx=460800
sensesiot_weizen.menu.UploadSpeed.460800.upload.speed=460800
sensesiot_weizen.menu.UploadSpeed.512000.windows=512000
sensesiot_weizen.menu.UploadSpeed.512000.upload.speed=512000

sensesiot_weizen.menu.DebugLevel.none=None
sensesiot_weizen.menu.DebugLevel.none.build.code_debug=0
sensesiot_weizen.menu.DebugLevel.error=Error
sensesiot_weizen.menu.DebugLevel.error.build.code_debug=1
sensesiot_weizen.menu.DebugLevel.warn=Warn
sensesiot_weizen.menu.DebugLevel.warn.build.code_debug=2
sensesiot_weizen.menu.DebugLevel.info=Info
sensesiot_weizen.menu.DebugLevel.info.build.code_debug=3
sensesiot_weizen.menu.DebugLevel.debug=Debug
sensesiot_weizen.menu.DebugLevel.debug.build.code_debug=4
sensesiot_weizen.menu.DebugLevel.verbose=Verbose
sensesiot_weizen.menu.DebugLevel.verbose.build.code_debug=5

sensesiot_weizen.menu.EraseFlash.none=Disabled
sensesiot_weizen.menu.EraseFlash.none.upload.erase_cmd=
sensesiot_weizen.menu.EraseFlash.all=Enabled
sensesiot_weizen.menu.EraseFlash.all.upload.erase_cmd=-e

