espressif/arduino-esp32/boards.txt
wifiduino32s3.menu.CPUFreq.240=240MHz (WiFi)
wifiduino32s3.menu.CPUFreq.240.build.f_cpu=240000000L
wifiduino32s3.menu.CPUFreq.160=160MHz (WiFi)
wifiduino32s3.menu.CPUFreq.160.build.f_cpu=160000000L
wifiduino32s3.menu.CPUFreq.80=80MHz (WiFi)
wifiduino32s3.menu.CPUFreq.80.build.f_cpu=80000000L
wifiduino32s3.menu.CPUFreq.40=40MHz
wifiduino32s3.menu.CPUFreq.40.build.f_cpu=40000000L
wifiduino32s3.menu.CPUFreq.20=20MHz
wifiduino32s3.menu.CPUFreq.20.build.f_cpu=20000000L
wifiduino32s3.menu.CPUFreq.10=10MHz
wifiduino32s3.menu.CPUFreq.10.build.f_cpu=10000000L

wifiduino32s3.menu.UploadSpeed.921600=921600
wifiduino32s3.menu.UploadSpeed.921600.upload.speed=921600
wifiduino32s3.menu.UploadSpeed.115200=115200
wifiduino32s3.menu.UploadSpeed.115200.upload.speed=115200
wifiduino32s3.menu.UploadSpeed.256000.windows=256000
wifiduino32s3.menu.UploadSpeed.256000.upload.speed=256000
wifiduino32s3.menu.UploadSpeed.230400.windows.upload.speed=256000
wifiduino32s3.menu.UploadSpeed.230400=230400
wifiduino32s3.menu.UploadSpeed.230400.upload.speed=230400
wifiduino32s3.menu.UploadSpeed.460800.linux=460800
wifiduino32s3.menu.UploadSpeed.460800.macosx=460800
wifiduino32s3.menu.UploadSpeed.460800.upload.speed=460800
wifiduino32s3.menu.UploadSpeed.512000.windows=512000
wifiduino32s3.menu.UploadSpeed.512000.upload.speed=512000

wifiduino32s3.menu.DebugLevel.none=None
wifiduino32s3.menu.DebugLevel.none.build.code_debug=0
wifiduino32s3.menu.DebugLevel.error=Error
wifiduino32s3.menu.DebugLevel.error.build.code_debug=1
wifiduino32s3.menu.DebugLevel.warn=Warn
wifiduino32s3.menu.DebugLevel.warn.build.code_debug=2
wifiduino32s3.menu.DebugLevel.info=Info
wifiduino32s3.menu.DebugLevel.info.build.code_debug=3
wifiduino32s3.menu.DebugLevel.debug=Debug
wifiduino32s3.menu.DebugLevel.debug.build.code_debug=4
wifiduino32s3.menu.DebugLevel.verbose=Verbose
wifiduino32s3.menu.DebugLevel.verbose.build.code_debug=5

wifiduino32s3.menu.EraseFlash.none=Disabled
wifiduino32s3.menu.EraseFlash.none.upload.erase_cmd=
wifiduino32s3.menu.EraseFlash.all=Enabled
wifiduino32s3.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

imbrios-logsens-v1p1.name=IMBRIOS LOGSENS_V1P1

imbrios-logsens-v1p1.bootloader.tool=esptool_py
imbrios-logsens-v1p1.bootloader.tool.default=esptool_py

imbrios-logsens-v1p1.upload.tool=esptool_py
imbrios-logsens-v1p1.upload.tool.default=esptool_py
imbrios-logsens-v1p1.upload.tool.network=esp_ota

imbrios-logsens-v1p1.upload.maximum_size=1310720
imbrios-logsens-v1p1.upload.maximum_data_size=327680
imbrios-logsens-v1p1.upload.wait_for_upload_port=true
imbrios-logsens-v1p1.upload.flags=
imbrios-logsens-v1p1.upload.extra_flags=

imbrios-logsens-v1p1.serial.disableDTR=true
imbrios-logsens-v1p1.serial.disableRTS=true

imbrios-logsens-v1p1.build.tarch=xtensa
imbrios-logsens-v1p1.build.bootloader_addr=0x1000
imbrios-logsens-v1p1.build.target=esp32
imbrios-logsens-v1p1.build.mcu=esp32
imbrios-logsens-v1p1.build.core=esp32
imbrios-logsens-v1p1.build.variant=imbrios-logsens-v1p1
imbrios-logsens-v1p1.build.board=IMBRIOS_LOGSENS_V1P1

imbrios-logsens-v1p1.build.f_cpu=240000000L
imbrios-logsens-v1p1.build.flash_mode=dio
imbrios-logsens-v1p1.build.flash_size=4MB
imbrios-logsens-v1p1.build.boot=dio
imbrios-logsens-v1p1.build.partitions=default
imbrios-logsens-v1p1.build.defines=

imbrios-logsens-v1p1.menu.FlashFreq.80=80MHz
imbrios-logsens-v1p1.menu.FlashFreq.80.build.flash_freq=80m
imbrios-logsens-v1p1.menu.FlashFreq.40=40MHz
imbrios-logsens-v1p1.menu.FlashFreq.40.build.flash_freq=40m

imbrios-logsens-v1p1.menu.PartitionScheme.default=Default
imbrios-logsens-v1p1.menu.PartitionScheme.default.build.partitions=default
imbrios-logsens-v1p1.menu.PartitionScheme.no_ota=No OTA (Large APP)
imbrios-logsens-v1p1.menu.PartitionScheme.no_ota.build.partitions=no_ota
imbrios-logsens-v1p1.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
imbrios-logsens-v1p1.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
imbrios-logsens-v1p1.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
imbrios-logsens-v1p1.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

imbrios-logsens-v1p1.menu.CPUFreq.240=240MHz (WiFi/BT)
imbrios-logsens-v1p1.menu.CPUFreq.240.build.f_cpu=240000000L
imbrios-logsens-v1p1.menu.CPUFreq.160=160MHz (WiFi/BT)
imbrios-logsens-v1p1.menu.CPUFreq.160.build.f_cpu=160000000L
imbrios-logsens-v1p1.menu.CPUFreq.80=80MHz (WiFi/BT)
imbrios-logsens-v1p1.menu.CPUFreq.80.build.f_cpu=80000000L
imbrios-logsens-v1p1.menu.CPUFreq.40=40MHz (40MHz XTAL)
imbrios-logsens-v1p1.menu.CPUFreq.40.build.f_cpu=40000000L
imbrios-logsens-v1p1.menu.CPUFreq.26=26MHz (26MHz XTAL)
imbrios-logsens-v1p1.menu.CPUFreq.26.build.f_cpu=26000000L
imbrios-logsens-v1p1.menu.CPUFreq.20=20MHz (40MHz XTAL)
imbrios-logsens-v1p1.menu.CPUFreq.20.build.f_cpu=20000000L
imbrios-logsens-v1p1.menu.CPUFreq.13=13MHz (26MHz XTAL)
imbrios-logsens-v1p1.menu.CPUFreq.13.build.f_cpu=13000000L
imbrios-logsens-v1p1.menu.CPUFreq.10=10MHz (40MHz XTAL)
imbrios-logsens-v1p1.menu.CPUFreq.10.build.f_cpu=10000000L

imbrios-logsens-v1p1.menu.UploadSpeed.921600=921600
imbrios-logsens-v1p1.menu.UploadSpeed.921600.upload.speed=921600
imbrios-logsens-v1p1.menu.UploadSpeed.115200=115200
imbrios-logsens-v1p1.menu.UploadSpeed.115200.upload.speed=115200
imbrios-logsens-v1p1.menu.UploadSpeed.256000.windows=256000
imbrios-logsens-v1p1.menu.UploadSpeed.256000.upload.speed=256000
imbrios-logsens-v1p1.menu.UploadSpeed.230400.windows.upload.speed=256000
imbrios-logsens-v1p1.menu.UploadSpeed.230400=230400
imbrios-logsens-v1p1.menu.UploadSpeed.230400.upload.speed=230400
imbrios-logsens-v1p1.menu.UploadSpeed.460800.linux=460800
imbrios-logsens-v1p1.menu.UploadSpeed.460800.macosx=460800
imbrios-logsens-v1p1.menu.UploadSpeed.460800.upload.speed=460800
imbrios-logsens-v1p1.menu.UploadSpeed.512000.windows=512000
imbrios-logsens-v1p1.menu.UploadSpeed.512000.upload.speed=512000

imbrios-logsens-v1p1.menu.DebugLevel.none=None
imbrios-logsens-v1p1.menu.DebugLevel.none.build.code_debug=0
imbrios-logsens-v1p1.menu.DebugLevel.error=Error
imbrios-logsens-v1p1.menu.DebugLevel.error.build.code_debug=1
imbrios-logsens-v1p1.menu.DebugLevel.warn=Warn
imbrios-logsens-v1p1.menu.DebugLevel.warn.build.code_debug=2
imbrios-logsens-v1p1.menu.DebugLevel.info=Info
imbrios-logsens-v1p1.menu.DebugLevel.info.build.code_debug=3
imbrios-logsens-v1p1.menu.DebugLevel.debug=Debug
imbrios-logsens-v1p1.menu.DebugLevel.debug.build.code_debug=4
imbrios-logsens-v1p1.menu.DebugLevel.verbose=Verbose
imbrios-logsens-v1p1.menu.DebugLevel.verbose.build.code_debug=5

imbrios-logsens-v1p1.menu.EraseFlash.none=Disabled
imbrios-logsens-v1p1.menu.EraseFlash.none.upload.erase_cmd=
imbrios-logsens-v1p1.menu.EraseFlash.all=Enabled
imbrios-logsens-v1p1.menu.EraseFlash.all.upload.erase_cmd=-e

