espressif/arduino-esp32/boards.txt
##############################################################

healthypi4.name=ProtoCentral HealthyPi 4

healthypi4.bootloader.tool=esptool_py
healthypi4.bootloader.tool.default=esptool_py

healthypi4.upload.tool=esptool_py
healthypi4.upload.tool.default=esptool_py
healthypi4.upload.tool.network=esp_ota

healthypi4.upload.maximum_size=1310720
healthypi4.upload.maximum_data_size=327680
healthypi4.upload.wait_for_upload_port=true
healthypi4.upload.flags=
healthypi4.upload.extra_flags=

healthypi4.serial.disableDTR=true
healthypi4.serial.disableRTS=true

healthypi4.build.tarch=xtensa
healthypi4.build.bootloader_addr=0x1000
healthypi4.build.target=esp32
healthypi4.build.mcu=esp32
healthypi4.build.core=esp32
healthypi4.build.variant=healthypi4
healthypi4.build.board=HEALTHYPI_4

healthypi4.build.f_cpu=240000000L
healthypi4.build.flash_mode=dio
healthypi4.build.flash_size=4MB
healthypi4.build.boot=dio
healthypi4.build.partitions=min_spiffs
healthypi4.build.defines=

healthypi4.menu.FlashFreq.80=80MHz
healthypi4.menu.FlashFreq.80.build.flash_freq=80m
healthypi4.menu.FlashFreq.40=40MHz
healthypi4.menu.FlashFreq.40.build.flash_freq=40m

healthypi4.menu.PartitionScheme.default=Default
healthypi4.menu.PartitionScheme.default.build.partitions=default
healthypi4.menu.PartitionScheme.no_ota=No OTA (Large APP)
healthypi4.menu.PartitionScheme.no_ota.build.partitions=no_ota
healthypi4.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
healthypi4.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
healthypi4.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
healthypi4.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

healthypi4.menu.UploadSpeed.921600=921600
healthypi4.menu.UploadSpeed.921600.upload.speed=921600
healthypi4.menu.UploadSpeed.115200=115200
healthypi4.menu.UploadSpeed.115200.upload.speed=115200
healthypi4.menu.UploadSpeed.256000.windows=256000
healthypi4.menu.UploadSpeed.256000.upload.speed=256000
healthypi4.menu.UploadSpeed.230400.windows.upload.speed=256000
healthypi4.menu.UploadSpeed.230400=230400
healthypi4.menu.UploadSpeed.230400.upload.speed=230400
healthypi4.menu.UploadSpeed.460800.linux=460800
healthypi4.menu.UploadSpeed.460800.macosx=460800
healthypi4.menu.UploadSpeed.460800.upload.speed=460800
healthypi4.menu.UploadSpeed.512000.windows=512000
healthypi4.menu.UploadSpeed.512000.upload.speed=512000

healthypi4.menu.DebugLevel.none=None
healthypi4.menu.DebugLevel.none.build.code_debug=0
healthypi4.menu.DebugLevel.error=Error
healthypi4.menu.DebugLevel.error.build.code_debug=1
healthypi4.menu.DebugLevel.warn=Warn
healthypi4.menu.DebugLevel.warn.build.code_debug=2
healthypi4.menu.DebugLevel.info=Info
healthypi4.menu.DebugLevel.info.build.code_debug=3
healthypi4.menu.DebugLevel.debug=Debug
healthypi4.menu.DebugLevel.debug.build.code_debug=4
healthypi4.menu.DebugLevel.verbose=Verbose
healthypi4.menu.DebugLevel.verbose.build.code_debug=5

healthypi4.menu.EraseFlash.none=Disabled
healthypi4.menu.EraseFlash.none.upload.erase_cmd=
healthypi4.menu.EraseFlash.all=Enabled
healthypi4.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

ET-Board.name=ET-Board

ET-Board.bootloader.tool=esptool_py
ET-Board.bootloader.tool.default=esptool_py

ET-Board.upload.tool=esptool_py
ET-Board.upload.tool.default=esptool_py
ET-Board.upload.tool.network=esp_ota

ET-Board.upload.maximum_size=1310720
ET-Board.upload.maximum_data_size=327680
ET-Board.upload.wait_for_upload_port=true
ET-Board.upload.flags=
ET-Board.upload.extra_flags=

ET-Board.serial.disableDTR=true
ET-Board.serial.disableRTS=true

ET-Board.build.tarch=xtensa
ET-Board.build.bootloader_addr=0x1000
ET-Board.build.target=esp32
ET-Board.build.mcu=esp32
ET-Board.build.core=esp32
ET-Board.build.variant=ET-Board
ET-Board.build.board=ET-Board
ET-Board.build.f_cpu=240000000L
ET-Board.build.flash_mode=dio
ET-Board.build.flash_size=4MB
ET-Board.build.boot=dio
ET-Board.build.partitions=default
ET-Board.build.defines=

ET-Board.menu.PartitionScheme.default=Default
ET-Board.menu.PartitionScheme.default.build.partitions=default
ET-Board.menu.PartitionScheme.no_ota=No OTA (Large APP)
ET-Board.menu.PartitionScheme.no_ota.build.partitions=no_ota
ET-Board.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
ET-Board.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
ET-Board.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
ET-Board.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

ET-Board.menu.FlashFreq.80=80MHz
ET-Board.menu.FlashFreq.80.build.flash_freq=80m
ET-Board.menu.FlashFreq.40=40MHz
ET-Board.menu.FlashFreq.40.build.flash_freq=40m

ET-Board.menu.UploadSpeed.921600=921600
ET-Board.menu.UploadSpeed.921600.upload.speed=921600
ET-Board.menu.UploadSpeed.115200=115200
ET-Board.menu.UploadSpeed.115200.upload.speed=115200
ET-Board.menu.UploadSpeed.256000.windows=256000
ET-Board.menu.UploadSpeed.256000.upload.speed=256000
ET-Board.menu.UploadSpeed.230400.windows.upload.speed=256000
ET-Board.menu.UploadSpeed.230400=230400
ET-Board.menu.UploadSpeed.230400.upload.speed=230400
ET-Board.menu.UploadSpeed.460800.linux=460800
ET-Board.menu.UploadSpeed.460800.macosx=460800
ET-Board.menu.UploadSpeed.460800.upload.speed=460800
ET-Board.menu.UploadSpeed.512000.windows=512000
ET-Board.menu.UploadSpeed.512000.upload.speed=512000

ET-Board.menu.DebugLevel.none=None
ET-Board.menu.DebugLevel.none.build.code_debug=0
ET-Board.menu.DebugLevel.error=Error
ET-Board.menu.DebugLevel.error.build.code_debug=1
ET-Board.menu.DebugLevel.warn=Warn
ET-Board.menu.DebugLevel.warn.build.code_debug=2
ET-Board.menu.DebugLevel.info=Info
ET-Board.menu.DebugLevel.info.build.code_debug=3
ET-Board.menu.DebugLevel.debug=Debug
ET-Board.menu.DebugLevel.debug.build.code_debug=4
ET-Board.menu.DebugLevel.verbose=Verbose
ET-Board.menu.DebugLevel.verbose.build.code_debug=5

ET-Board.menu.EraseFlash.none=Disabled
ET-Board.menu.EraseFlash.none.upload.erase_cmd=
ET-Board.menu.EraseFlash.all=Enabled
ET-Board.menu.EraseFlash.all.upload.erase_cmd=-e

