espressif/arduino-esp32/boards.txt
##############################################################

deneyapkart.name=Deneyap Kart

deneyapkart.bootloader.tool=esptool_py
deneyapkart.bootloader.tool.default=esptool_py

deneyapkart.upload.tool=esptool_py
deneyapkart.upload.tool.default=esptool_py
deneyapkart.upload.tool.network=esp_ota

deneyapkart.upload.maximum_size=1310720
deneyapkart.upload.maximum_data_size=327680
deneyapkart.upload.wait_for_upload_port=true
deneyapkart.upload.flags=
deneyapkart.upload.extra_flags=

deneyapkart.serial.disableDTR=true
deneyapkart.serial.disableRTS=true

deneyapkart.build.tarch=xtensa
deneyapkart.build.bootloader_addr=0x1000
deneyapkart.build.target=esp32
deneyapkart.build.mcu=esp32
deneyapkart.build.core=esp32
deneyapkart.build.variant=deneyapkart
deneyapkart.build.board=DYDK

deneyapkart.build.f_cpu=240000000L
deneyapkart.build.flash_size=4MB
deneyapkart.build.flash_freq=40m
deneyapkart.build.flash_mode=dio
deneyapkart.build.boot=dio
deneyapkart.build.partitions=default
deneyapkart.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
deneyapkart.build.extra_libs=

deneyapkart.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
deneyapkart.menu.PartitionScheme.default.build.partitions=default
deneyapkart.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
deneyapkart.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
deneyapkart.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
deneyapkart.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
deneyapkart.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
deneyapkart.menu.PartitionScheme.minimal.build.partitions=minimal
deneyapkart.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
deneyapkart.menu.PartitionScheme.no_ota.build.partitions=no_ota
deneyapkart.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
deneyapkart.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
deneyapkart.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
deneyapkart.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
deneyapkart.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
deneyapkart.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
deneyapkart.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
deneyapkart.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
deneyapkart.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
deneyapkart.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
deneyapkart.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
deneyapkart.menu.PartitionScheme.huge_app.build.partitions=huge_app
deneyapkart.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
deneyapkart.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
deneyapkart.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
deneyapkart.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
deneyapkart.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
deneyapkart.menu.PartitionScheme.fatflash.build.partitions=ffat
deneyapkart.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
deneyapkart.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
deneyapkart.menu.PartitionScheme.rainmaker=RainMaker
deneyapkart.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
deneyapkart.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

deneyapkart.menu.CPUFreq.240=240MHz (WiFi/BT)
deneyapkart.menu.CPUFreq.240.build.f_cpu=240000000L
deneyapkart.menu.CPUFreq.160=160MHz (WiFi/BT)
deneyapkart.menu.CPUFreq.160.build.f_cpu=160000000L
deneyapkart.menu.CPUFreq.80=80MHz (WiFi/BT)
deneyapkart.menu.CPUFreq.80.build.f_cpu=80000000L
deneyapkart.menu.CPUFreq.40=40MHz
deneyapkart.menu.CPUFreq.40.build.f_cpu=40000000L
deneyapkart.menu.CPUFreq.20=20MHz
deneyapkart.menu.CPUFreq.20.build.f_cpu=20000000L
deneyapkart.menu.CPUFreq.10=10MHz
deneyapkart.menu.CPUFreq.10.build.f_cpu=10000000L

deneyapkart.menu.FlashMode.qio=QIO
deneyapkart.menu.FlashMode.qio.build.flash_mode=dio
deneyapkart.menu.FlashMode.qio.build.boot=qio
deneyapkart.menu.FlashMode.dio=DIO
deneyapkart.menu.FlashMode.dio.build.flash_mode=dio
deneyapkart.menu.FlashMode.dio.build.boot=dio
deneyapkart.menu.FlashMode.qout=QOUT
deneyapkart.menu.FlashMode.qout.build.flash_mode=dout
deneyapkart.menu.FlashMode.qout.build.boot=qout
deneyapkart.menu.FlashMode.dout=DOUT
deneyapkart.menu.FlashMode.dout.build.flash_mode=dout
deneyapkart.menu.FlashMode.dout.build.boot=dout

deneyapkart.menu.FlashFreq.80=80MHz
deneyapkart.menu.FlashFreq.80.build.flash_freq=80m
deneyapkart.menu.FlashFreq.40=40MHz
deneyapkart.menu.FlashFreq.40.build.flash_freq=40m

deneyapkart.menu.UploadSpeed.921600=921600
deneyapkart.menu.UploadSpeed.921600.upload.speed=921600
deneyapkart.menu.UploadSpeed.115200=115200
deneyapkart.menu.UploadSpeed.115200.upload.speed=115200
deneyapkart.menu.UploadSpeed.256000.windows=256000
deneyapkart.menu.UploadSpeed.256000.upload.speed=256000
deneyapkart.menu.UploadSpeed.230400.windows.upload.speed=256000
deneyapkart.menu.UploadSpeed.230400=230400
deneyapkart.menu.UploadSpeed.230400.upload.speed=230400
deneyapkart.menu.UploadSpeed.460800.linux=460800
deneyapkart.menu.UploadSpeed.460800.macosx=460800
deneyapkart.menu.UploadSpeed.460800.upload.speed=460800
deneyapkart.menu.UploadSpeed.512000.windows=512000
deneyapkart.menu.UploadSpeed.512000.upload.speed=512000

deneyapkart.menu.DebugLevel.none=None
deneyapkart.menu.DebugLevel.none.build.code_debug=0
deneyapkart.menu.DebugLevel.error=Error
deneyapkart.menu.DebugLevel.error.build.code_debug=1
deneyapkart.menu.DebugLevel.warn=Warn
deneyapkart.menu.DebugLevel.warn.build.code_debug=2
deneyapkart.menu.DebugLevel.info=Info
deneyapkart.menu.DebugLevel.info.build.code_debug=3
deneyapkart.menu.DebugLevel.debug=Debug
deneyapkart.menu.DebugLevel.debug.build.code_debug=4
deneyapkart.menu.DebugLevel.verbose=Verbose
deneyapkart.menu.DebugLevel.verbose.build.code_debug=5

deneyapkart.menu.EraseFlash.none=Disabled
deneyapkart.menu.EraseFlash.none.upload.erase_cmd=
deneyapkart.menu.EraseFlash.all=Enabled
deneyapkart.menu.EraseFlash.all.upload.erase_cmd=-e

