espressif/arduino-esp32/boards.txt
deneyapmini.menu.UploadMode.default=Internal USB
deneyapmini.menu.UploadMode.default.upload.use_1200bps_touch=true
deneyapmini.menu.UploadMode.default.upload.wait_for_upload_port=true
deneyapmini.menu.UploadMode.default.upload.mode=default_reset
deneyapmini.menu.UploadMode.cdc=UART0
deneyapmini.menu.UploadMode.cdc.upload.use_1200bps_touch=false
deneyapmini.menu.UploadMode.cdc.upload.wait_for_upload_port=false
deneyapmini.menu.UploadMode.cdc.upload.mode=default_reset

deneyapmini.menu.UploadSpeed.921600=921600
deneyapmini.menu.UploadSpeed.921600.upload.speed=921600
deneyapmini.menu.UploadSpeed.115200=115200
deneyapmini.menu.UploadSpeed.115200.upload.speed=115200
deneyapmini.menu.UploadSpeed.256000.windows=256000
deneyapmini.menu.UploadSpeed.256000.upload.speed=256000
deneyapmini.menu.UploadSpeed.230400.windows.upload.speed=256000
deneyapmini.menu.UploadSpeed.230400=230400
deneyapmini.menu.UploadSpeed.230400.upload.speed=230400
deneyapmini.menu.UploadSpeed.460800.linux=460800
deneyapmini.menu.UploadSpeed.460800.macosx=460800
deneyapmini.menu.UploadSpeed.460800.upload.speed=460800
deneyapmini.menu.UploadSpeed.512000.windows=512000
deneyapmini.menu.UploadSpeed.512000.upload.speed=512000

deneyapmini.menu.DebugLevel.none=None
deneyapmini.menu.DebugLevel.none.build.code_debug=0
deneyapmini.menu.DebugLevel.error=Error
deneyapmini.menu.DebugLevel.error.build.code_debug=1
deneyapmini.menu.DebugLevel.warn=Warn
deneyapmini.menu.DebugLevel.warn.build.code_debug=2
deneyapmini.menu.DebugLevel.info=Info
deneyapmini.menu.DebugLevel.info.build.code_debug=3
deneyapmini.menu.DebugLevel.debug=Debug
deneyapmini.menu.DebugLevel.debug.build.code_debug=4
deneyapmini.menu.DebugLevel.verbose=Verbose
deneyapmini.menu.DebugLevel.verbose.build.code_debug=5

deneyapmini.menu.EraseFlash.none=Disabled
deneyapmini.menu.EraseFlash.none.upload.erase_cmd=
deneyapmini.menu.EraseFlash.all=Enabled
deneyapmini.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

deneyapkart1A.name=Deneyap Kart 1A

deneyapkart1A.bootloader.tool=esptool_py
deneyapkart1A.bootloader.tool.default=esptool_py

deneyapkart1A.upload.tool=esptool_py
deneyapkart1A.upload.tool.default=esptool_py
deneyapkart1A.upload.tool.network=esp_ota

deneyapkart1A.upload.maximum_size=1310720
deneyapkart1A.upload.maximum_data_size=327680
deneyapkart1A.upload.wait_for_upload_port=true
deneyapkart1A.upload.flags=
deneyapkart1A.upload.extra_flags=

deneyapkart1A.serial.disableDTR=true
deneyapkart1A.serial.disableRTS=true

deneyapkart1A.build.tarch=xtensa
deneyapkart1A.build.bootloader_addr=0x1000
deneyapkart1A.build.target=esp32
deneyapkart1A.build.mcu=esp32
deneyapkart1A.build.core=esp32
deneyapkart1A.build.variant=deneyapkart1A
deneyapkart1A.build.board=DYDK1A

deneyapkart1A.build.f_cpu=240000000L
deneyapkart1A.build.flash_size=4MB
deneyapkart1A.build.flash_freq=40m
deneyapkart1A.build.flash_mode=dio
deneyapkart1A.build.boot=dio
deneyapkart1A.build.partitions=default
deneyapkart1A.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
deneyapkart1A.build.extra_libs=

deneyapkart1A.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
deneyapkart1A.menu.PartitionScheme.default.build.partitions=default
deneyapkart1A.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
deneyapkart1A.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
deneyapkart1A.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
deneyapkart1A.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
deneyapkart1A.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
deneyapkart1A.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
deneyapkart1A.menu.PartitionScheme.minimal.build.partitions=minimal
deneyapkart1A.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
deneyapkart1A.menu.PartitionScheme.no_ota.build.partitions=no_ota
deneyapkart1A.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
deneyapkart1A.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
deneyapkart1A.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
deneyapkart1A.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
deneyapkart1A.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
deneyapkart1A.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
deneyapkart1A.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
deneyapkart1A.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
deneyapkart1A.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
deneyapkart1A.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
deneyapkart1A.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
deneyapkart1A.menu.PartitionScheme.huge_app.build.partitions=huge_app
deneyapkart1A.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
deneyapkart1A.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
deneyapkart1A.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
deneyapkart1A.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
deneyapkart1A.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
deneyapkart1A.menu.PartitionScheme.fatflash.build.partitions=ffat
deneyapkart1A.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
deneyapkart1A.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
deneyapkart1A.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
deneyapkart1A.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
deneyapkart1A.menu.PartitionScheme.rainmaker=RainMaker
deneyapkart1A.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
deneyapkart1A.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

deneyapkart1A.menu.CPUFreq.240=240MHz (WiFi/BT)
deneyapkart1A.menu.CPUFreq.240.build.f_cpu=240000000L
deneyapkart1A.menu.CPUFreq.160=160MHz (WiFi/BT)
deneyapkart1A.menu.CPUFreq.160.build.f_cpu=160000000L
deneyapkart1A.menu.CPUFreq.80=80MHz (WiFi/BT)
deneyapkart1A.menu.CPUFreq.80.build.f_cpu=80000000L
deneyapkart1A.menu.CPUFreq.40=40MHz
deneyapkart1A.menu.CPUFreq.40.build.f_cpu=40000000L
deneyapkart1A.menu.CPUFreq.20=20MHz
deneyapkart1A.menu.CPUFreq.20.build.f_cpu=20000000L
deneyapkart1A.menu.CPUFreq.10=10MHz
deneyapkart1A.menu.CPUFreq.10.build.f_cpu=10000000L

deneyapkart1A.menu.FlashMode.qio=QIO
deneyapkart1A.menu.FlashMode.qio.build.flash_mode=dio
deneyapkart1A.menu.FlashMode.qio.build.boot=qio
deneyapkart1A.menu.FlashMode.dio=DIO
deneyapkart1A.menu.FlashMode.dio.build.flash_mode=dio
deneyapkart1A.menu.FlashMode.dio.build.boot=dio
deneyapkart1A.menu.FlashMode.qout=QOUT
deneyapkart1A.menu.FlashMode.qout.build.flash_mode=dout
deneyapkart1A.menu.FlashMode.qout.build.boot=qout
deneyapkart1A.menu.FlashMode.dout=DOUT
deneyapkart1A.menu.FlashMode.dout.build.flash_mode=dout
deneyapkart1A.menu.FlashMode.dout.build.boot=dout

