espressif/arduino-esp32/boards.txt
deneyapkart1A.menu.FlashFreq.80=80MHz
deneyapkart1A.menu.FlashFreq.80.build.flash_freq=80m
deneyapkart1A.menu.FlashFreq.40=40MHz
deneyapkart1A.menu.FlashFreq.40.build.flash_freq=40m

deneyapkart1A.menu.UploadSpeed.921600=921600
deneyapkart1A.menu.UploadSpeed.921600.upload.speed=921600
deneyapkart1A.menu.UploadSpeed.115200=115200
deneyapkart1A.menu.UploadSpeed.115200.upload.speed=115200
deneyapkart1A.menu.UploadSpeed.256000.windows=256000
deneyapkart1A.menu.UploadSpeed.256000.upload.speed=256000
deneyapkart1A.menu.UploadSpeed.230400.windows.upload.speed=256000
deneyapkart1A.menu.UploadSpeed.230400=230400
deneyapkart1A.menu.UploadSpeed.230400.upload.speed=230400
deneyapkart1A.menu.UploadSpeed.460800.linux=460800
deneyapkart1A.menu.UploadSpeed.460800.macosx=460800
deneyapkart1A.menu.UploadSpeed.460800.upload.speed=460800
deneyapkart1A.menu.UploadSpeed.512000.windows=512000
deneyapkart1A.menu.UploadSpeed.512000.upload.speed=512000

deneyapkart1A.menu.DebugLevel.none=None
deneyapkart1A.menu.DebugLevel.none.build.code_debug=0
deneyapkart1A.menu.DebugLevel.error=Error
deneyapkart1A.menu.DebugLevel.error.build.code_debug=1
deneyapkart1A.menu.DebugLevel.warn=Warn
deneyapkart1A.menu.DebugLevel.warn.build.code_debug=2
deneyapkart1A.menu.DebugLevel.info=Info
deneyapkart1A.menu.DebugLevel.info.build.code_debug=3
deneyapkart1A.menu.DebugLevel.debug=Debug
deneyapkart1A.menu.DebugLevel.debug.build.code_debug=4
deneyapkart1A.menu.DebugLevel.verbose=Verbose
deneyapkart1A.menu.DebugLevel.verbose.build.code_debug=5

deneyapkart1A.menu.EraseFlash.none=Disabled
deneyapkart1A.menu.EraseFlash.none.upload.erase_cmd=
deneyapkart1A.menu.EraseFlash.all=Enabled
deneyapkart1A.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

deneyapkartg.name=Deneyap Kart G
deneyapkartg.vid.0=0x303a
deneyapkartg.pid.0=0x1001

deneyapkartg.bootloader.tool=esptool_py
deneyapkartg.bootloader.tool.default=esptool_py

deneyapkartg.upload.tool=esptool_py
deneyapkartg.upload.tool.default=esptool_py
deneyapkartg.upload.tool.network=esp_ota

deneyapkartg.upload.maximum_size=1310720
deneyapkartg.upload.maximum_data_size=327680
deneyapkartg.upload.flags=
deneyapkartg.upload.extra_flags=
deneyapkartg.upload.use_1200bps_touch=false
deneyapkartg.upload.wait_for_upload_port=false

deneyapkartg.serial.disableDTR=false
deneyapkartg.serial.disableRTS=false

deneyapkartg.build.tarch=riscv32
deneyapkartg.build.target=esp
deneyapkartg.build.mcu=esp32c3
deneyapkartg.build.core=esp32
deneyapkartg.build.variant=deneyapkartg
deneyapkartg.build.board=DYG
deneyapkartg.build.bootloader_addr=0x0

deneyapkartg.build.cdc_on_boot=0
deneyapkartg.build.f_cpu=160000000L
deneyapkartg.build.flash_size=4MB
deneyapkartg.build.flash_freq=80m
deneyapkartg.build.flash_mode=qio
deneyapkartg.build.boot=qio
deneyapkartg.build.partitions=default
deneyapkartg.build.defines=

deneyapkartg.menu.CDCOnBoot.cdc=Enabled
deneyapkartg.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
deneyapkartg.menu.CDCOnBoot.default=Disabled
deneyapkartg.menu.CDCOnBoot.default.build.cdc_on_boot=0

deneyapkartg.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
deneyapkartg.menu.PartitionScheme.default.build.partitions=default
deneyapkartg.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
deneyapkartg.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
deneyapkartg.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
deneyapkartg.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
deneyapkartg.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
deneyapkartg.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
deneyapkartg.menu.PartitionScheme.minimal.build.partitions=minimal
deneyapkartg.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
deneyapkartg.menu.PartitionScheme.no_ota.build.partitions=no_ota
deneyapkartg.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
deneyapkartg.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
deneyapkartg.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
deneyapkartg.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
deneyapkartg.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
deneyapkartg.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
deneyapkartg.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
deneyapkartg.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
deneyapkartg.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
deneyapkartg.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
deneyapkartg.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
deneyapkartg.menu.PartitionScheme.huge_app.build.partitions=huge_app
deneyapkartg.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
deneyapkartg.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
deneyapkartg.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
deneyapkartg.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
deneyapkartg.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
deneyapkartg.menu.PartitionScheme.fatflash.build.partitions=ffat
deneyapkartg.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
deneyapkartg.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
deneyapkartg.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
deneyapkartg.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
deneyapkartg.menu.PartitionScheme.rainmaker=RainMaker
deneyapkartg.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
deneyapkartg.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

deneyapkartg.menu.CPUFreq.160=160MHz (WiFi)
deneyapkartg.menu.CPUFreq.160.build.f_cpu=160000000L
deneyapkartg.menu.CPUFreq.80=80MHz (WiFi)
deneyapkartg.menu.CPUFreq.80.build.f_cpu=80000000L
deneyapkartg.menu.CPUFreq.40=40MHz
deneyapkartg.menu.CPUFreq.40.build.f_cpu=40000000L
deneyapkartg.menu.CPUFreq.20=20MHz
deneyapkartg.menu.CPUFreq.20.build.f_cpu=20000000L
deneyapkartg.menu.CPUFreq.10=10MHz
deneyapkartg.menu.CPUFreq.10.build.f_cpu=10000000L

deneyapkartg.menu.FlashMode.qio=QIO
deneyapkartg.menu.FlashMode.qio.build.flash_mode=dio
deneyapkartg.menu.FlashMode.qio.build.boot=qio
deneyapkartg.menu.FlashMode.dio=DIO
deneyapkartg.menu.FlashMode.dio.build.flash_mode=dio
deneyapkartg.menu.FlashMode.dio.build.boot=dio
deneyapkartg.menu.FlashMode.qout=QOUT
deneyapkartg.menu.FlashMode.qout.build.flash_mode=dout
deneyapkartg.menu.FlashMode.qout.build.boot=qout
deneyapkartg.menu.FlashMode.dout=DOUT
deneyapkartg.menu.FlashMode.dout.build.flash_mode=dout
deneyapkartg.menu.FlashMode.dout.build.boot=dout

deneyapkartg.menu.FlashFreq.80=80MHz
deneyapkartg.menu.FlashFreq.80.build.flash_freq=80m
deneyapkartg.menu.FlashFreq.40=40MHz
deneyapkartg.menu.FlashFreq.40.build.flash_freq=40m

deneyapkartg.menu.FlashSize.4M=4MB (32Mb)
deneyapkartg.menu.FlashSize.4M.build.flash_size=4MB
deneyapkartg.menu.FlashSize.8M=8MB (64Mb)
deneyapkartg.menu.FlashSize.8M.build.flash_size=8MB
deneyapkartg.menu.FlashSize.8M.build.partitions=default_8MB
deneyapkartg.menu.FlashSize.2M=2MB (16Mb)
deneyapkartg.menu.FlashSize.2M.build.flash_size=2MB
deneyapkartg.menu.FlashSize.2M.build.partitions=minimal
deneyapkartg.menu.FlashSize.16M=16MB (128Mb)
deneyapkartg.menu.FlashSize.16M.build.flash_size=16MB

deneyapkartg.menu.UploadSpeed.921600=921600
deneyapkartg.menu.UploadSpeed.921600.upload.speed=921600
deneyapkartg.menu.UploadSpeed.115200=115200
deneyapkartg.menu.UploadSpeed.115200.upload.speed=115200
deneyapkartg.menu.UploadSpeed.256000.windows=256000
deneyapkartg.menu.UploadSpeed.256000.upload.speed=256000
deneyapkartg.menu.UploadSpeed.230400.windows.upload.speed=256000
deneyapkartg.menu.UploadSpeed.230400=230400
deneyapkartg.menu.UploadSpeed.230400.upload.speed=230400
deneyapkartg.menu.UploadSpeed.460800.linux=460800
deneyapkartg.menu.UploadSpeed.460800.macosx=460800
deneyapkartg.menu.UploadSpeed.460800.upload.speed=460800
deneyapkartg.menu.UploadSpeed.512000.windows=512000
deneyapkartg.menu.UploadSpeed.512000.upload.speed=512000

deneyapkartg.menu.DebugLevel.none=None
deneyapkartg.menu.DebugLevel.none.build.code_debug=0
deneyapkartg.menu.DebugLevel.error=Error
deneyapkartg.menu.DebugLevel.error.build.code_debug=1
deneyapkartg.menu.DebugLevel.warn=Warn
deneyapkartg.menu.DebugLevel.warn.build.code_debug=2
deneyapkartg.menu.DebugLevel.info=Info
deneyapkartg.menu.DebugLevel.info.build.code_debug=3
deneyapkartg.menu.DebugLevel.debug=Debug
deneyapkartg.menu.DebugLevel.debug.build.code_debug=4
deneyapkartg.menu.DebugLevel.verbose=Verbose
deneyapkartg.menu.DebugLevel.verbose.build.code_debug=5

deneyapkartg.menu.EraseFlash.none=Disabled
deneyapkartg.menu.EraseFlash.none.upload.erase_cmd=
deneyapkartg.menu.EraseFlash.all=Enabled
deneyapkartg.menu.EraseFlash.all.upload.erase_cmd=-e

