espressif/arduino-esp32/boards.txt
sonoff_dualr3.menu.PartitionScheme.rainmaker=RainMaker
sonoff_dualr3.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
sonoff_dualr3.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

sonoff_dualr3.menu.CPUFreq.240=240MHz (WiFi/BT)
sonoff_dualr3.menu.CPUFreq.240.build.f_cpu=240000000L
sonoff_dualr3.menu.CPUFreq.160=160MHz (WiFi/BT)
sonoff_dualr3.menu.CPUFreq.160.build.f_cpu=160000000L
sonoff_dualr3.menu.CPUFreq.80=80MHz (WiFi/BT)
sonoff_dualr3.menu.CPUFreq.80.build.f_cpu=80000000L
sonoff_dualr3.menu.CPUFreq.40=40MHz (40MHz XTAL)
sonoff_dualr3.menu.CPUFreq.40.build.f_cpu=40000000L
sonoff_dualr3.menu.CPUFreq.26=26MHz (26MHz XTAL)
sonoff_dualr3.menu.CPUFreq.26.build.f_cpu=26000000L
sonoff_dualr3.menu.CPUFreq.20=20MHz (40MHz XTAL)
sonoff_dualr3.menu.CPUFreq.20.build.f_cpu=20000000L
sonoff_dualr3.menu.CPUFreq.13=13MHz (26MHz XTAL)
sonoff_dualr3.menu.CPUFreq.13.build.f_cpu=13000000L
sonoff_dualr3.menu.CPUFreq.10=10MHz (40MHz XTAL)
sonoff_dualr3.menu.CPUFreq.10.build.f_cpu=10000000L

sonoff_dualr3.menu.FlashMode.qio=QIO
sonoff_dualr3.menu.FlashMode.qio.build.flash_mode=dio
sonoff_dualr3.menu.FlashMode.qio.build.boot=qio
sonoff_dualr3.menu.FlashMode.dio=DIO
sonoff_dualr3.menu.FlashMode.dio.build.flash_mode=dio
sonoff_dualr3.menu.FlashMode.dio.build.boot=dio
sonoff_dualr3.menu.FlashMode.qout=QOUT
sonoff_dualr3.menu.FlashMode.qout.build.flash_mode=dout
sonoff_dualr3.menu.FlashMode.qout.build.boot=qout
sonoff_dualr3.menu.FlashMode.dout=DOUT
sonoff_dualr3.menu.FlashMode.dout.build.flash_mode=dout
sonoff_dualr3.menu.FlashMode.dout.build.boot=dout

sonoff_dualr3.menu.FlashFreq.80=80MHz
sonoff_dualr3.menu.FlashFreq.80.build.flash_freq=80m
sonoff_dualr3.menu.FlashFreq.40=40MHz
sonoff_dualr3.menu.FlashFreq.40.build.flash_freq=40m

sonoff_dualr3.menu.FlashSize.4M=4MB (32Mb)
sonoff_dualr3.menu.FlashSize.4M.build.flash_size=4MB

sonoff_dualr3.menu.UploadSpeed.921600=921600
sonoff_dualr3.menu.UploadSpeed.921600.upload.speed=921600
sonoff_dualr3.menu.UploadSpeed.115200=115200
sonoff_dualr3.menu.UploadSpeed.115200.upload.speed=115200
sonoff_dualr3.menu.UploadSpeed.256000.windows=256000
sonoff_dualr3.menu.UploadSpeed.256000.upload.speed=256000
sonoff_dualr3.menu.UploadSpeed.230400.windows.upload.speed=256000
sonoff_dualr3.menu.UploadSpeed.230400=230400
sonoff_dualr3.menu.UploadSpeed.230400.upload.speed=230400
sonoff_dualr3.menu.UploadSpeed.460800.linux=460800
sonoff_dualr3.menu.UploadSpeed.460800.macosx=460800
sonoff_dualr3.menu.UploadSpeed.460800.upload.speed=460800
sonoff_dualr3.menu.UploadSpeed.512000.windows=512000
sonoff_dualr3.menu.UploadSpeed.512000.upload.speed=512000

sonoff_dualr3.menu.DebugLevel.none=None
sonoff_dualr3.menu.DebugLevel.none.build.code_debug=0
sonoff_dualr3.menu.DebugLevel.error=Error
sonoff_dualr3.menu.DebugLevel.error.build.code_debug=1
sonoff_dualr3.menu.DebugLevel.warn=Warn
sonoff_dualr3.menu.DebugLevel.warn.build.code_debug=2
sonoff_dualr3.menu.DebugLevel.info=Info
sonoff_dualr3.menu.DebugLevel.info.build.code_debug=3
sonoff_dualr3.menu.DebugLevel.debug=Debug
sonoff_dualr3.menu.DebugLevel.debug.build.code_debug=4
sonoff_dualr3.menu.DebugLevel.verbose=Verbose
sonoff_dualr3.menu.DebugLevel.verbose.build.code_debug=5

sonoff_dualr3.menu.EraseFlash.none=Disabled
sonoff_dualr3.menu.EraseFlash.none.upload.erase_cmd=
sonoff_dualr3.menu.EraseFlash.all=Enabled
sonoff_dualr3.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
lionbit.name=Lion:Bit Dev Board

lionbit.bootloader.tool=esptool_py
lionbit.bootloader.tool.default=esptool_py

lionbit.upload.tool=esptool_py
lionbit.upload.tool.default=esptool_py
lionbit.upload.tool.network=esp_ota

lionbit.upload.maximum_size=1310720
lionbit.upload.maximum_data_size=327680
lionbit.upload.flags=
lionbit.upload.extra_flags=

lionbit.serial.disableDTR=true
lionbit.serial.disableRTS=true

lionbit.build.tarch=xtensa
lionbit.build.bootloader_addr=0x1000
lionbit.build.target=esp32
lionbit.build.mcu=esp32
lionbit.build.core=esp32
lionbit.build.variant=lionbit
lionbit.build.board=Lion:Bit_Dev_Board

lionbit.build.f_cpu=240000000L
lionbit.build.flash_size=4MB
lionbit.build.flash_freq=80m
lionbit.build.flash_mode=dio
lionbit.build.boot=dio
lionbit.build.partitions=default
lionbit.build.defines=
lionbit.build.loop_core=
lionbit.build.event_core=


lionbit.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
lionbit.menu.PartitionScheme.default.build.partitions=default
lionbit.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
lionbit.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
lionbit.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
lionbit.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
lionbit.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
lionbit.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
lionbit.menu.PartitionScheme.minimal.build.partitions=minimal
lionbit.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
lionbit.menu.PartitionScheme.no_ota.build.partitions=no_ota
lionbit.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
lionbit.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
lionbit.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
lionbit.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
lionbit.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
lionbit.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
lionbit.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
lionbit.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
lionbit.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
lionbit.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
lionbit.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
lionbit.menu.PartitionScheme.huge_app.build.partitions=huge_app
lionbit.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
lionbit.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
lionbit.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
lionbit.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
lionbit.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
lionbit.menu.PartitionScheme.fatflash.build.partitions=ffat
lionbit.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
lionbit.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
lionbit.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
lionbit.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
lionbit.menu.PartitionScheme.rainmaker=RainMaker
lionbit.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
lionbit.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

lionbit.menu.CPUFreq.240=240MHz (WiFi/BT)
lionbit.menu.CPUFreq.240.build.f_cpu=240000000L
lionbit.menu.CPUFreq.160=160MHz (WiFi/BT)
lionbit.menu.CPUFreq.160.build.f_cpu=160000000L
lionbit.menu.CPUFreq.80=80MHz (WiFi/BT)
lionbit.menu.CPUFreq.80.build.f_cpu=80000000L
lionbit.menu.CPUFreq.40=40MHz (40MHz XTAL)
lionbit.menu.CPUFreq.40.build.f_cpu=40000000L
lionbit.menu.CPUFreq.26=26MHz (26MHz XTAL)
lionbit.menu.CPUFreq.26.build.f_cpu=26000000L
lionbit.menu.CPUFreq.20=20MHz (40MHz XTAL)
lionbit.menu.CPUFreq.20.build.f_cpu=20000000L
lionbit.menu.CPUFreq.13=13MHz (26MHz XTAL)
lionbit.menu.CPUFreq.13.build.f_cpu=13000000L
lionbit.menu.CPUFreq.10=10MHz (40MHz XTAL)
lionbit.menu.CPUFreq.10.build.f_cpu=10000000L


