espressif/arduino-esp32/boards.txt
lionbit.menu.FlashMode.dio=DIO
lionbit.menu.FlashMode.dio.build.flash_mode=dio
lionbit.menu.FlashMode.dio.build.boot=dio
lionbit.menu.FlashMode.qio=QIO
lionbit.menu.FlashMode.qio.build.flash_mode=dio
lionbit.menu.FlashMode.qio.build.boot=qio
lionbit.menu.FlashMode.qout=QOUT
lionbit.menu.FlashMode.qout.build.flash_mode=dout
lionbit.menu.FlashMode.qout.build.boot=qout
lionbit.menu.FlashMode.dout=DOUT
lionbit.menu.FlashMode.dout.build.flash_mode=dout
lionbit.menu.FlashMode.dout.build.boot=dout

lionbit.menu.FlashFreq.80=80MHz
lionbit.menu.FlashFreq.80.build.flash_freq=80m
lionbit.menu.FlashFreq.40=40MHz
lionbit.menu.FlashFreq.40.build.flash_freq=40m

lionbit.menu.FlashSize.4M=4MB (32Mb)
lionbit.menu.FlashSize.4M.build.flash_size=4MB
lionbit.menu.FlashSize.4M.build.partitions=default



lionbit.menu.UploadSpeed.115200=115200
lionbit.menu.UploadSpeed.115200.upload.speed=115200
lionbit.menu.UploadSpeed.256000.windows=256000
lionbit.menu.UploadSpeed.256000.upload.speed=256000
lionbit.menu.UploadSpeed.230400.windows.upload.speed=256000
lionbit.menu.UploadSpeed.230400=230400
lionbit.menu.UploadSpeed.230400.upload.speed=230400
lionbit.menu.UploadSpeed.460800.linux=460800
lionbit.menu.UploadSpeed.460800.macosx=460800
lionbit.menu.UploadSpeed.460800.upload.speed=460800


lionbit.menu.LoopCore.1=Core 1
lionbit.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
lionbit.menu.LoopCore.0=Core 0
lionbit.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

lionbit.menu.EventsCore.1=Core 1
lionbit.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
lionbit.menu.EventsCore.0=Core 0
lionbit.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

lionbit.menu.DebugLevel.none=None
lionbit.menu.DebugLevel.none.build.code_debug=0
lionbit.menu.DebugLevel.error=Error
lionbit.menu.DebugLevel.error.build.code_debug=1
lionbit.menu.DebugLevel.warn=Warn
lionbit.menu.DebugLevel.warn.build.code_debug=2
lionbit.menu.DebugLevel.info=Info
lionbit.menu.DebugLevel.info.build.code_debug=3
lionbit.menu.DebugLevel.debug=Debug
lionbit.menu.DebugLevel.debug.build.code_debug=4
lionbit.menu.DebugLevel.verbose=Verbose
lionbit.menu.DebugLevel.verbose.build.code_debug=5

lionbit.menu.EraseFlash.none=Disabled
lionbit.menu.EraseFlash.none.upload.erase_cmd=
lionbit.menu.EraseFlash.all=Enabled
lionbit.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

watchy.name=Watchy

watchy.bootloader.tool=esptool_py
watchy.bootloader.tool.default=esptool_py

watchy.upload.tool=esptool_py
watchy.upload.tool.default=esptool_py
watchy.upload.tool.network=esp_ota

watchy.upload.maximum_size=1310720
watchy.upload.maximum_data_size=327680
watchy.upload.flags=
watchy.upload.extra_flags=

watchy.serial.disableDTR=true
watchy.serial.disableRTS=true

watchy.build.tarch=xtensa
watchy.build.bootloader_addr=0x1000
watchy.build.target=esp32
watchy.build.mcu=esp32
watchy.build.core=esp32
watchy.build.variant=watchy
watchy.build.board=WATCHY

watchy.build.f_cpu=240000000L
watchy.build.flash_size=4MB
watchy.build.flash_freq=80m
watchy.build.flash_mode=dio
watchy.build.boot=qio
watchy.build.partitions=min_spiffs
watchy.build.defines=

watchy.menu.Revision.v10=Watchy v1.0
watchy.menu.Revision.v10.build.board=WATCHY_V10
watchy.menu.Revision.v15=Watchy v1.5
watchy.menu.Revision.v15.build.board=WATCHY_V15
watchy.menu.Revision.v20=Watchy v2.0
watchy.menu.Revision.v20.build.board=WATCHY_V20

watchy.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
watchy.menu.PartitionScheme.huge_app.build.partitions=huge_app
watchy.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
watchy.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
watchy.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
watchy.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

watchy.menu.UploadSpeed.921600=921600
watchy.menu.UploadSpeed.921600.upload.speed=921600
watchy.menu.UploadSpeed.115200=115200
watchy.menu.UploadSpeed.115200.upload.speed=115200
watchy.menu.UploadSpeed.256000.windows=256000
watchy.menu.UploadSpeed.256000.upload.speed=256000
watchy.menu.UploadSpeed.230400.windows.upload.speed=256000
watchy.menu.UploadSpeed.230400=230400
watchy.menu.UploadSpeed.230400.upload.speed=230400
watchy.menu.UploadSpeed.460800.linux=460800
watchy.menu.UploadSpeed.460800.macosx=460800
watchy.menu.UploadSpeed.460800.upload.speed=460800
watchy.menu.UploadSpeed.512000.windows=512000
watchy.menu.UploadSpeed.512000.upload.speed=512000

watchy.menu.DebugLevel.none=None
watchy.menu.DebugLevel.none.build.code_debug=0
watchy.menu.DebugLevel.error=Error
watchy.menu.DebugLevel.error.build.code_debug=1
watchy.menu.DebugLevel.warn=Warn
watchy.menu.DebugLevel.warn.build.code_debug=2
watchy.menu.DebugLevel.info=Info
watchy.menu.DebugLevel.info.build.code_debug=3
watchy.menu.DebugLevel.debug=Debug
watchy.menu.DebugLevel.debug.build.code_debug=4
watchy.menu.DebugLevel.verbose=Verbose
watchy.menu.DebugLevel.verbose.build.code_debug=5

watchy.menu.EraseFlash.none=Disabled
watchy.menu.EraseFlash.none.upload.erase_cmd=
watchy.menu.EraseFlash.all=Enabled
watchy.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

AirM2M_CORE_ESP32C3.name=AirM2M_CORE_ESP32C3
AirM2M_CORE_ESP32C3.vid.0=0x303a
AirM2M_CORE_ESP32C3.pid.0=0x1001

AirM2M_CORE_ESP32C3.upload.tool=esptool_py
AirM2M_CORE_ESP32C3.upload.tool.default=esptool_py
AirM2M_CORE_ESP32C3.upload.tool.network=esp_ota
AirM2M_CORE_ESP32C3.upload.maximum_size=1310720
AirM2M_CORE_ESP32C3.upload.maximum_data_size=327680
AirM2M_CORE_ESP32C3.upload.flags=
AirM2M_CORE_ESP32C3.upload.extra_flags=
AirM2M_CORE_ESP32C3.upload.use_1200bps_touch=false
AirM2M_CORE_ESP32C3.upload.wait_for_upload_port=false

AirM2M_CORE_ESP32C3.serial.disableDTR=false
AirM2M_CORE_ESP32C3.serial.disableRTS=false

AirM2M_CORE_ESP32C3.build.tarch=riscv32
AirM2M_CORE_ESP32C3.build.target=esp
AirM2M_CORE_ESP32C3.build.mcu=esp32c3
AirM2M_CORE_ESP32C3.build.core=esp32
AirM2M_CORE_ESP32C3.build.variant=AirM2M_CORE_ESP32C3
AirM2M_CORE_ESP32C3.build.board=AirM2M_CORE_ESP32C3
AirM2M_CORE_ESP32C3.build.bootloader_addr=0x0

AirM2M_CORE_ESP32C3.build.cdc_on_boot=0
AirM2M_CORE_ESP32C3.build.f_cpu=160000000L
AirM2M_CORE_ESP32C3.build.flash_size=4MB
AirM2M_CORE_ESP32C3.build.flash_freq=80m
AirM2M_CORE_ESP32C3.build.flash_mode=dio
AirM2M_CORE_ESP32C3.build.boot=dio
AirM2M_CORE_ESP32C3.build.partitions=default
AirM2M_CORE_ESP32C3.build.defines=

AirM2M_CORE_ESP32C3.menu.CDCOnBoot.default=Disabled
AirM2M_CORE_ESP32C3.menu.CDCOnBoot.default.build.cdc_on_boot=0
AirM2M_CORE_ESP32C3.menu.CDCOnBoot.cdc=Enabled
AirM2M_CORE_ESP32C3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

AirM2M_CORE_ESP32C3.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
AirM2M_CORE_ESP32C3.menu.PartitionScheme.default.build.partitions=default
AirM2M_CORE_ESP32C3.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
AirM2M_CORE_ESP32C3.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
AirM2M_CORE_ESP32C3.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
AirM2M_CORE_ESP32C3.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
AirM2M_CORE_ESP32C3.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
AirM2M_CORE_ESP32C3.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
AirM2M_CORE_ESP32C3.menu.PartitionScheme.minimal.build.partitions=minimal
AirM2M_CORE_ESP32C3.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
AirM2M_CORE_ESP32C3.menu.PartitionScheme.no_ota.build.partitions=no_ota
AirM2M_CORE_ESP32C3.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
AirM2M_CORE_ESP32C3.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
AirM2M_CORE_ESP32C3.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
AirM2M_CORE_ESP32C3.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
AirM2M_CORE_ESP32C3.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
AirM2M_CORE_ESP32C3.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
AirM2M_CORE_ESP32C3.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
AirM2M_CORE_ESP32C3.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
AirM2M_CORE_ESP32C3.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
AirM2M_CORE_ESP32C3.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
AirM2M_CORE_ESP32C3.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
AirM2M_CORE_ESP32C3.menu.PartitionScheme.huge_app.build.partitions=huge_app
AirM2M_CORE_ESP32C3.menu.PartitionScheme.huge_app.upload.maximum_size=3145728

AirM2M_CORE_ESP32C3.menu.CPUFreq.160=160MHz (WiFi)
AirM2M_CORE_ESP32C3.menu.CPUFreq.160.build.f_cpu=160000000L
AirM2M_CORE_ESP32C3.menu.CPUFreq.80=80MHz (WiFi)
AirM2M_CORE_ESP32C3.menu.CPUFreq.80.build.f_cpu=80000000L
AirM2M_CORE_ESP32C3.menu.CPUFreq.40=40MHz
AirM2M_CORE_ESP32C3.menu.CPUFreq.40.build.f_cpu=40000000L
AirM2M_CORE_ESP32C3.menu.CPUFreq.20=20MHz
AirM2M_CORE_ESP32C3.menu.CPUFreq.20.build.f_cpu=20000000L
AirM2M_CORE_ESP32C3.menu.CPUFreq.10=10MHz
AirM2M_CORE_ESP32C3.menu.CPUFreq.10.build.f_cpu=10000000L

AirM2M_CORE_ESP32C3.menu.FlashFreq.80=80MHz
AirM2M_CORE_ESP32C3.menu.FlashFreq.80.build.flash_freq=80m
AirM2M_CORE_ESP32C3.menu.FlashFreq.40=40MHz
AirM2M_CORE_ESP32C3.menu.FlashFreq.40.build.flash_freq=40m

AirM2M_CORE_ESP32C3.menu.UploadSpeed.921600=921600
AirM2M_CORE_ESP32C3.menu.UploadSpeed.921600.upload.speed=921600
AirM2M_CORE_ESP32C3.menu.UploadSpeed.115200=115200
AirM2M_CORE_ESP32C3.menu.UploadSpeed.115200.upload.speed=115200
AirM2M_CORE_ESP32C3.menu.UploadSpeed.1152000=1152000
AirM2M_CORE_ESP32C3.menu.UploadSpeed.1152000.upload.speed=1152000


AirM2M_CORE_ESP32C3.menu.DebugLevel.none=None
AirM2M_CORE_ESP32C3.menu.DebugLevel.none.build.code_debug=0
AirM2M_CORE_ESP32C3.menu.DebugLevel.error=Error
AirM2M_CORE_ESP32C3.menu.DebugLevel.error.build.code_debug=1
AirM2M_CORE_ESP32C3.menu.DebugLevel.warn=Warn
AirM2M_CORE_ESP32C3.menu.DebugLevel.warn.build.code_debug=2
AirM2M_CORE_ESP32C3.menu.DebugLevel.info=Info
AirM2M_CORE_ESP32C3.menu.DebugLevel.info.build.code_debug=3
AirM2M_CORE_ESP32C3.menu.DebugLevel.debug=Debug
AirM2M_CORE_ESP32C3.menu.DebugLevel.debug.build.code_debug=4
AirM2M_CORE_ESP32C3.menu.DebugLevel.verbose=Verbose
AirM2M_CORE_ESP32C3.menu.DebugLevel.verbose.build.code_debug=5

AirM2M_CORE_ESP32C3.menu.EraseFlash.none=Disabled
AirM2M_CORE_ESP32C3.menu.EraseFlash.none.upload.erase_cmd=
AirM2M_CORE_ESP32C3.menu.EraseFlash.all=Enabled
AirM2M_CORE_ESP32C3.menu.EraseFlash.all.upload.erase_cmd=-e

#############################################################


XIAO_ESP32C3.name=XIAO_ESP32C3
XIAO_ESP32C3.vid.0=0x2886
XIAO_ESP32C3.pid.0=0x0047

XIAO_ESP32C3.bootloader.tool=esptool_py
XIAO_ESP32C3.bootloader.tool.default=esptool_py

XIAO_ESP32C3.upload.tool=esptool_py
XIAO_ESP32C3.upload.tool.default=esptool_py
XIAO_ESP32C3.upload.tool.network=esp_ota

XIAO_ESP32C3.upload.maximum_size=1310720
XIAO_ESP32C3.upload.maximum_data_size=327680
XIAO_ESP32C3.upload.flags=
XIAO_ESP32C3.upload.extra_flags=
XIAO_ESP32C3.upload.use_1200bps_touch=false
XIAO_ESP32C3.upload.wait_for_upload_port=false

XIAO_ESP32C3.serial.disableDTR=false
XIAO_ESP32C3.serial.disableRTS=false

