espressif/arduino-esp32/boards.txt
aw2eth.menu.PartitionScheme.default=Default
aw2eth.menu.PartitionScheme.default.build.partitions=default
aw2eth.menu.PartitionScheme.no_ota=No OTA (Large APP)
aw2eth.menu.PartitionScheme.no_ota.build.partitions=no_ota
aw2eth.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
aw2eth.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
aw2eth.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
aw2eth.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

aw2eth.menu.UploadSpeed.921600=921600
aw2eth.menu.UploadSpeed.921600.upload.speed=921600
aw2eth.menu.UploadSpeed.115200=115200
aw2eth.menu.UploadSpeed.115200.upload.speed=115200
aw2eth.menu.UploadSpeed.256000.windows=256000
aw2eth.menu.UploadSpeed.256000.upload.speed=256000
aw2eth.menu.UploadSpeed.230400.windows.upload.speed=256000
aw2eth.menu.UploadSpeed.230400=230400
aw2eth.menu.UploadSpeed.230400.upload.speed=230400
aw2eth.menu.UploadSpeed.460800.linux=460800
aw2eth.menu.UploadSpeed.460800.macosx=460800
aw2eth.menu.UploadSpeed.460800.upload.speed=460800
aw2eth.menu.UploadSpeed.512000.windows=512000
aw2eth.menu.UploadSpeed.512000.upload.speed=512000

aw2eth.menu.DebugLevel.none=None
aw2eth.menu.DebugLevel.none.build.code_debug=0
aw2eth.menu.DebugLevel.error=Error
aw2eth.menu.DebugLevel.error.build.code_debug=1
aw2eth.menu.DebugLevel.warn=Warn
aw2eth.menu.DebugLevel.warn.build.code_debug=2
aw2eth.menu.DebugLevel.info=Info
aw2eth.menu.DebugLevel.info.build.code_debug=3
aw2eth.menu.DebugLevel.debug=Debug
aw2eth.menu.DebugLevel.debug.build.code_debug=4
aw2eth.menu.DebugLevel.verbose=Verbose
aw2eth.menu.DebugLevel.verbose.build.code_debug=5

aw2eth.menu.EraseFlash.none=Disabled
aw2eth.menu.EraseFlash.none.upload.erase_cmd=
aw2eth.menu.EraseFlash.all=Enabled
aw2eth.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

department_of_alchemy_minimain_esp32s2.name=Department of Alchemy MiniMain ESP32-S2
department_of_alchemy_minimain_esp32s2.vid.0=0x303A
department_of_alchemy_minimain_esp32s2.pid.0=0x80FF

department_of_alchemy_minimain_esp32s2.bootloader.tool=esptool_py
department_of_alchemy_minimain_esp32s2.bootloader.tool.default=esptool_py

department_of_alchemy_minimain_esp32s2.upload.tool=esptool_py
department_of_alchemy_minimain_esp32s2.upload.tool.default=esptool_py
department_of_alchemy_minimain_esp32s2.upload.tool.network=esp_ota

department_of_alchemy_minimain_esp32s2.upload.maximum_size=1310720
department_of_alchemy_minimain_esp32s2.upload.maximum_data_size=327680
department_of_alchemy_minimain_esp32s2.upload.flags=
department_of_alchemy_minimain_esp32s2.upload.extra_flags=
department_of_alchemy_minimain_esp32s2.upload.use_1200bps_touch=true
department_of_alchemy_minimain_esp32s2.upload.wait_for_upload_port=true

department_of_alchemy_minimain_esp32s2.serial.disableDTR=false
department_of_alchemy_minimain_esp32s2.serial.disableRTS=false

department_of_alchemy_minimain_esp32s2.build.tarch=xtensa
department_of_alchemy_minimain_esp32s2.build.bootloader_addr=0x1000
department_of_alchemy_minimain_esp32s2.build.target=esp32s2
department_of_alchemy_minimain_esp32s2.build.mcu=esp32s2
department_of_alchemy_minimain_esp32s2.build.core=esp32
department_of_alchemy_minimain_esp32s2.build.variant=department_of_alchemy_minimain_esp32s2
department_of_alchemy_minimain_esp32s2.build.board=DEPARTMENT_OF_ALCHEMY_MINIMAIN_ESP32S2

department_of_alchemy_minimain_esp32s2.build.cdc_on_boot=1
department_of_alchemy_minimain_esp32s2.build.msc_on_boot=0
department_of_alchemy_minimain_esp32s2.build.dfu_on_boot=0
department_of_alchemy_minimain_esp32s2.build.f_cpu=240000000L
department_of_alchemy_minimain_esp32s2.build.flash_size=4MB
department_of_alchemy_minimain_esp32s2.build.flash_freq=80m
department_of_alchemy_minimain_esp32s2.build.flash_mode=qio
department_of_alchemy_minimain_esp32s2.build.boot=qio
department_of_alchemy_minimain_esp32s2.build.partitions=default
department_of_alchemy_minimain_esp32s2.build.defines=

department_of_alchemy_minimain_esp32s2.menu.CDCOnBoot.cdc=Enabled
department_of_alchemy_minimain_esp32s2.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
department_of_alchemy_minimain_esp32s2.menu.CDCOnBoot.default=Disabled
department_of_alchemy_minimain_esp32s2.menu.CDCOnBoot.default.build.cdc_on_boot=0

department_of_alchemy_minimain_esp32s2.menu.MSCOnBoot.default=Disabled
department_of_alchemy_minimain_esp32s2.menu.MSCOnBoot.default.build.msc_on_boot=0
department_of_alchemy_minimain_esp32s2.menu.MSCOnBoot.msc=Enabled
department_of_alchemy_minimain_esp32s2.menu.MSCOnBoot.msc.build.msc_on_boot=1

department_of_alchemy_minimain_esp32s2.menu.DFUOnBoot.default=Disabled
department_of_alchemy_minimain_esp32s2.menu.DFUOnBoot.default.build.dfu_on_boot=0
department_of_alchemy_minimain_esp32s2.menu.DFUOnBoot.dfu=Enabled
department_of_alchemy_minimain_esp32s2.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

department_of_alchemy_minimain_esp32s2.menu.UploadMode.cdc=Internal USB
department_of_alchemy_minimain_esp32s2.menu.UploadMode.cdc.upload.use_1200bps_touch=true
department_of_alchemy_minimain_esp32s2.menu.UploadMode.cdc.upload.wait_for_upload_port=true
department_of_alchemy_minimain_esp32s2.menu.UploadMode.default=UART0
department_of_alchemy_minimain_esp32s2.menu.UploadMode.default.upload.use_1200bps_touch=false
department_of_alchemy_minimain_esp32s2.menu.UploadMode.default.upload.wait_for_upload_port=false

department_of_alchemy_minimain_esp32s2.menu.PSRAM.enabled=Enabled
department_of_alchemy_minimain_esp32s2.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
department_of_alchemy_minimain_esp32s2.menu.PSRAM.disabled=Disabled
department_of_alchemy_minimain_esp32s2.menu.PSRAM.disabled.build.defines=

department_of_alchemy_minimain_esp32s2.menu.PartitionScheme.tinyuf2=TinyUF2 4MB (1.3MB APP/960KB FFAT)
department_of_alchemy_minimain_esp32s2.menu.PartitionScheme.tinyuf2.build.custom_bootloader=bootloader-tinyuf2
department_of_alchemy_minimain_esp32s2.menu.PartitionScheme.tinyuf2.build.custom_partitions=partitions-4MB-tinyuf2
department_of_alchemy_minimain_esp32s2.menu.PartitionScheme.tinyuf2.upload.maximum_size=1441792
department_of_alchemy_minimain_esp32s2.menu.PartitionScheme.tinyuf2.upload.extra_flags=0x2d0000 "{runtime.platform.path}/variants/{build.variant}/tinyuf2.bin"
department_of_alchemy_minimain_esp32s2.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
department_of_alchemy_minimain_esp32s2.menu.PartitionScheme.default.build.partitions=default
department_of_alchemy_minimain_esp32s2.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
department_of_alchemy_minimain_esp32s2.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
department_of_alchemy_minimain_esp32s2.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
department_of_alchemy_minimain_esp32s2.menu.PartitionScheme.minimal.build.partitions=minimal
department_of_alchemy_minimain_esp32s2.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
department_of_alchemy_minimain_esp32s2.menu.PartitionScheme.no_ota.build.partitions=no_ota
department_of_alchemy_minimain_esp32s2.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
department_of_alchemy_minimain_esp32s2.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
department_of_alchemy_minimain_esp32s2.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
department_of_alchemy_minimain_esp32s2.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
department_of_alchemy_minimain_esp32s2.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
department_of_alchemy_minimain_esp32s2.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
department_of_alchemy_minimain_esp32s2.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
department_of_alchemy_minimain_esp32s2.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
department_of_alchemy_minimain_esp32s2.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
department_of_alchemy_minimain_esp32s2.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
department_of_alchemy_minimain_esp32s2.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
department_of_alchemy_minimain_esp32s2.menu.PartitionScheme.huge_app.build.partitions=huge_app
department_of_alchemy_minimain_esp32s2.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
department_of_alchemy_minimain_esp32s2.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
department_of_alchemy_minimain_esp32s2.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
department_of_alchemy_minimain_esp32s2.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

department_of_alchemy_minimain_esp32s2.menu.CPUFreq.240=240MHz (WiFi)
department_of_alchemy_minimain_esp32s2.menu.CPUFreq.240.build.f_cpu=240000000L
department_of_alchemy_minimain_esp32s2.menu.CPUFreq.160=160MHz (WiFi)
department_of_alchemy_minimain_esp32s2.menu.CPUFreq.160.build.f_cpu=160000000L
department_of_alchemy_minimain_esp32s2.menu.CPUFreq.80=80MHz (WiFi)
department_of_alchemy_minimain_esp32s2.menu.CPUFreq.80.build.f_cpu=80000000L
department_of_alchemy_minimain_esp32s2.menu.CPUFreq.40=40MHz
department_of_alchemy_minimain_esp32s2.menu.CPUFreq.40.build.f_cpu=40000000L
department_of_alchemy_minimain_esp32s2.menu.CPUFreq.20=20MHz
department_of_alchemy_minimain_esp32s2.menu.CPUFreq.20.build.f_cpu=20000000L
department_of_alchemy_minimain_esp32s2.menu.CPUFreq.10=10MHz
department_of_alchemy_minimain_esp32s2.menu.CPUFreq.10.build.f_cpu=10000000L

