espressif/arduino-esp32/boards.txt
department_of_alchemy_minimain_esp32s2.menu.FlashMode.qio=QIO
department_of_alchemy_minimain_esp32s2.menu.FlashMode.qio.build.flash_mode=dio
department_of_alchemy_minimain_esp32s2.menu.FlashMode.qio.build.boot=qio
department_of_alchemy_minimain_esp32s2.menu.FlashMode.dio=DIO
department_of_alchemy_minimain_esp32s2.menu.FlashMode.dio.build.flash_mode=dio
department_of_alchemy_minimain_esp32s2.menu.FlashMode.dio.build.boot=dio
department_of_alchemy_minimain_esp32s2.menu.FlashMode.qout=QOUT
department_of_alchemy_minimain_esp32s2.menu.FlashMode.qout.build.flash_mode=dout
department_of_alchemy_minimain_esp32s2.menu.FlashMode.qout.build.boot=qout
department_of_alchemy_minimain_esp32s2.menu.FlashMode.dout=DOUT
department_of_alchemy_minimain_esp32s2.menu.FlashMode.dout.build.flash_mode=dout
department_of_alchemy_minimain_esp32s2.menu.FlashMode.dout.build.boot=dout

department_of_alchemy_minimain_esp32s2.menu.FlashFreq.80=80MHz
department_of_alchemy_minimain_esp32s2.menu.FlashFreq.80.build.flash_freq=80m
department_of_alchemy_minimain_esp32s2.menu.FlashFreq.40=40MHz
department_of_alchemy_minimain_esp32s2.menu.FlashFreq.40.build.flash_freq=40m

department_of_alchemy_minimain_esp32s2.menu.FlashSize.4M=4MB (32Mb)
department_of_alchemy_minimain_esp32s2.menu.FlashSize.4M.build.flash_size=4MB
department_of_alchemy_minimain_esp32s2.menu.FlashSize.8M=8MB (64Mb)
department_of_alchemy_minimain_esp32s2.menu.FlashSize.8M.build.flash_size=8MB
department_of_alchemy_minimain_esp32s2.menu.FlashSize.8M.build.partitions=default_8MB
department_of_alchemy_minimain_esp32s2.menu.FlashSize.2M=2MB (16Mb)
department_of_alchemy_minimain_esp32s2.menu.FlashSize.2M.build.flash_size=2MB
department_of_alchemy_minimain_esp32s2.menu.FlashSize.2M.build.partitions=minimal
department_of_alchemy_minimain_esp32s2.menu.FlashSize.16M=16MB (128Mb)
department_of_alchemy_minimain_esp32s2.menu.FlashSize.16M.build.flash_size=16MB

department_of_alchemy_minimain_esp32s2.menu.UploadSpeed.921600=921600
department_of_alchemy_minimain_esp32s2.menu.UploadSpeed.921600.upload.speed=921600
department_of_alchemy_minimain_esp32s2.menu.UploadSpeed.115200=115200
department_of_alchemy_minimain_esp32s2.menu.UploadSpeed.115200.upload.speed=115200
department_of_alchemy_minimain_esp32s2.menu.UploadSpeed.256000.windows=256000
department_of_alchemy_minimain_esp32s2.menu.UploadSpeed.256000.upload.speed=256000
department_of_alchemy_minimain_esp32s2.menu.UploadSpeed.230400.windows.upload.speed=256000
department_of_alchemy_minimain_esp32s2.menu.UploadSpeed.230400=230400
department_of_alchemy_minimain_esp32s2.menu.UploadSpeed.230400.upload.speed=230400
department_of_alchemy_minimain_esp32s2.menu.UploadSpeed.460800.linux=460800
department_of_alchemy_minimain_esp32s2.menu.UploadSpeed.460800.macosx=460800
department_of_alchemy_minimain_esp32s2.menu.UploadSpeed.460800.upload.speed=460800
department_of_alchemy_minimain_esp32s2.menu.UploadSpeed.512000.windows=512000
department_of_alchemy_minimain_esp32s2.menu.UploadSpeed.512000.upload.speed=512000

department_of_alchemy_minimain_esp32s2.menu.DebugLevel.none=None
department_of_alchemy_minimain_esp32s2.menu.DebugLevel.none.build.code_debug=0
department_of_alchemy_minimain_esp32s2.menu.DebugLevel.error=Error
department_of_alchemy_minimain_esp32s2.menu.DebugLevel.error.build.code_debug=1
department_of_alchemy_minimain_esp32s2.menu.DebugLevel.warn=Warn
department_of_alchemy_minimain_esp32s2.menu.DebugLevel.warn.build.code_debug=2
department_of_alchemy_minimain_esp32s2.menu.DebugLevel.info=Info
department_of_alchemy_minimain_esp32s2.menu.DebugLevel.info.build.code_debug=3
department_of_alchemy_minimain_esp32s2.menu.DebugLevel.debug=Debug
department_of_alchemy_minimain_esp32s2.menu.DebugLevel.debug.build.code_debug=4
department_of_alchemy_minimain_esp32s2.menu.DebugLevel.verbose=Verbose
department_of_alchemy_minimain_esp32s2.menu.DebugLevel.verbose.build.code_debug=5

department_of_alchemy_minimain_esp32s2.menu.EraseFlash.none=Disabled
department_of_alchemy_minimain_esp32s2.menu.EraseFlash.none.upload.erase_cmd=
department_of_alchemy_minimain_esp32s2.menu.EraseFlash.all=Enabled
department_of_alchemy_minimain_esp32s2.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

Bee_Motion_S3.name=Bee Motion S3
Bee_Motion_S3.vid.0=0x303a
Bee_Motion_S3.pid.0=0x8113

Bee_Motion_S3.bootloader.tool=esptool_py
Bee_Motion_S3.bootloader.tool.default=esptool_py

Bee_Motion_S3.upload.tool=esptool_py
Bee_Motion_S3.upload.tool.default=esptool_py
Bee_Motion_S3.upload.tool.network=esp_ota

Bee_Motion_S3.upload.maximum_size=1310720
Bee_Motion_S3.upload.maximum_data_size=327680
Bee_Motion_S3.upload.flags=
Bee_Motion_S3.upload.extra_flags=
Bee_Motion_S3.upload.use_1200bps_touch=true
Bee_Motion_S3.upload.wait_for_upload_port=true
Bee_Motion_S3.upload.speed=921600

Bee_Motion_S3.serial.disableDTR=false
Bee_Motion_S3.serial.disableRTS=false

Bee_Motion_S3.build.tarch=xtensa
Bee_Motion_S3.build.bootloader_addr=0x0
Bee_Motion_S3.build.target=esp32s3
Bee_Motion_S3.build.mcu=esp32s3
Bee_Motion_S3.build.core=esp32
Bee_Motion_S3.build.variant=Bee_Motion_S3
Bee_Motion_S3.build.board=BeeMotionS3

Bee_Motion_S3.build.cdc_on_boot=1
Bee_Motion_S3.build.msc_on_boot=1
Bee_Motion_S3.build.dfu_on_boot=1
Bee_Motion_S3.build.f_cpu=240000000L
Bee_Motion_S3.build.flash_size=8MB
Bee_Motion_S3.build.flash_freq=80m
Bee_Motion_S3.build.flash_mode=dio
Bee_Motion_S3.build.partitions=default_8MB
Bee_Motion_S3.build.defines=
Bee_Motion_S3.build.loop_core=-DARDUINO_RUNNING_CORE=1
Bee_Motion_S3.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
Bee_Motion_S3.build.boot=qio
Bee_Motion_S3.build.partitions=default
Bee_Motion_S3.build.defines=

Bee_Motion_S3.menu.CDCOnBoot.default=Enabled
Bee_Motion_S3.menu.CDCOnBoot.default.build.cdc_on_boot=1
Bee_Motion_S3.menu.CDCOnBoot.dis_cdc=Disabled
Bee_Motion_S3.menu.CDCOnBoot.dis_cdc.build.cdc_on_boot=0

Bee_Motion_S3.menu.MSCOnBoot.default=Disabled
Bee_Motion_S3.menu.MSCOnBoot.default.build.msc_on_boot=0
Bee_Motion_S3.menu.MSCOnBoot.msc=Enabled
Bee_Motion_S3.menu.MSCOnBoot.msc.build.msc_on_boot=1

