espressif/arduino-esp32/boards.txt
Bee_S3.menu.MSCOnBoot.default=Disabled
Bee_S3.menu.MSCOnBoot.default.build.msc_on_boot=0
Bee_S3.menu.MSCOnBoot.msc=Enabled
Bee_S3.menu.MSCOnBoot.msc.build.msc_on_boot=1

Bee_S3.menu.DFUOnBoot.default=Disabled
Bee_S3.menu.DFUOnBoot.default.build.dfu_on_boot=0
Bee_S3.menu.DFUOnBoot.dfu=Enabled
Bee_S3.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

Bee_S3.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
Bee_S3.menu.PartitionScheme.default.build.partitions=default
Bee_S3.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
Bee_S3.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
Bee_S3.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
Bee_S3.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
Bee_S3.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
Bee_S3.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
Bee_S3.menu.PartitionScheme.minimal.build.partitions=minimal
Bee_S3.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
Bee_S3.menu.PartitionScheme.no_ota.build.partitions=no_ota
Bee_S3.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
Bee_S3.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
Bee_S3.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
Bee_S3.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
Bee_S3.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
Bee_S3.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
Bee_S3.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
Bee_S3.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
Bee_S3.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
Bee_S3.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
Bee_S3.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
Bee_S3.menu.PartitionScheme.huge_app.build.partitions=huge_app
Bee_S3.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
Bee_S3.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
Bee_S3.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
Bee_S3.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
Bee_S3.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
Bee_S3.menu.PartitionScheme.fatflash.build.partitions=ffat
Bee_S3.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
Bee_S3.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
Bee_S3.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
Bee_S3.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728

Bee_S3.menu.CPUFreq.240=240MHz (WiFi)
Bee_S3.menu.CPUFreq.240.build.f_cpu=240000000L
Bee_S3.menu.CPUFreq.160=160MHz (WiFi)
Bee_S3.menu.CPUFreq.160.build.f_cpu=160000000L
Bee_S3.menu.CPUFreq.80=80MHz (WiFi)
Bee_S3.menu.CPUFreq.80.build.f_cpu=80000000L
Bee_S3.menu.CPUFreq.40=40MHz
Bee_S3.menu.CPUFreq.40.build.f_cpu=40000000L
Bee_S3.menu.CPUFreq.20=20MHz
Bee_S3.menu.CPUFreq.20.build.f_cpu=20000000L
Bee_S3.menu.CPUFreq.10=10MHz
Bee_S3.menu.CPUFreq.10.build.f_cpu=10000000L

Bee_S3.menu.FlashFreq.80=80MHz
Bee_S3.menu.FlashFreq.80.build.flash_freq=80m
Bee_S3.menu.FlashFreq.40=40MHz
Bee_S3.menu.FlashFreq.40.build.flash_freq=40m

Bee_S3.menu.UploadSpeed.921600=921600
Bee_S3.menu.UploadSpeed.921600.upload.speed=921600
Bee_S3.menu.UploadSpeed.115200=115200
Bee_S3.menu.UploadSpeed.115200.upload.speed=115200
Bee_S3.menu.UploadSpeed.256000.windows=256000
Bee_S3.menu.UploadSpeed.256000.upload.speed=256000
Bee_S3.menu.UploadSpeed.230400.windows.upload.speed=256000
Bee_S3.menu.UploadSpeed.230400=230400
Bee_S3.menu.UploadSpeed.230400.upload.speed=230400
Bee_S3.menu.UploadSpeed.460800.linux=460800
Bee_S3.menu.UploadSpeed.460800.macosx=460800
Bee_S3.menu.UploadSpeed.460800.upload.speed=460800
Bee_S3.menu.UploadSpeed.512000.windows=512000
Bee_S3.menu.UploadSpeed.512000.upload.speed=512000

Bee_S3.menu.DebugLevel.none=None
Bee_S3.menu.DebugLevel.none.build.code_debug=0
Bee_S3.menu.DebugLevel.error=Error
Bee_S3.menu.DebugLevel.error.build.code_debug=1
Bee_S3.menu.DebugLevel.warn=Warn
Bee_S3.menu.DebugLevel.warn.build.code_debug=2
Bee_S3.menu.DebugLevel.info=Info
Bee_S3.menu.DebugLevel.info.build.code_debug=3
Bee_S3.menu.DebugLevel.debug=Debug
Bee_S3.menu.DebugLevel.debug.build.code_debug=4
Bee_S3.menu.DebugLevel.verbose=Verbose
Bee_S3.menu.DebugLevel.verbose.build.code_debug=5

Bee_S3.menu.EraseFlash.none=Disabled
Bee_S3.menu.EraseFlash.none.upload.erase_cmd=
Bee_S3.menu.EraseFlash.all=Enabled
Bee_S3.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

unphone7.name=unPhone 7

unphone7.bootloader.tool=esptool_py
unphone7.bootloader.tool.default=esptool_py

unphone7.upload.tool=esptool_py
unphone7.upload.tool.default=esptool_py
unphone7.upload.tool.network=esp_ota

unphone7.upload.maximum_size=1310720
unphone7.upload.maximum_data_size=327680
unphone7.upload.flags=
unphone7.upload.extra_flags=

unphone7.serial.disableDTR=true
unphone7.serial.disableRTS=true

unphone7.build.tarch=xtensa
unphone7.build.bootloader_addr=0x1000
unphone7.build.target=esp32
unphone7.build.mcu=esp32
unphone7.build.core=esp32
unphone7.build.variant=feather_esp32
unphone7.build.board=FEATHER_ESP32

unphone7.build.f_cpu=240000000L
unphone7.build.flash_mode=dio
unphone7.build.flash_size=4MB
unphone7.build.boot=dio
unphone7.build.partitions=default
unphone7.build.defines=-DUNPHONE_SPIN=7

unphone7.menu.FlashFreq.80=80MHz
unphone7.menu.FlashFreq.80.build.flash_freq=80m
unphone7.menu.FlashFreq.40=40MHz
unphone7.menu.FlashFreq.40.build.flash_freq=40m

unphone7.menu.UploadSpeed.921600=921600
unphone7.menu.UploadSpeed.921600.upload.speed=921600
unphone7.menu.UploadSpeed.115200=115200
unphone7.menu.UploadSpeed.115200.upload.speed=115200
unphone7.menu.UploadSpeed.256000.windows=256000
unphone7.menu.UploadSpeed.256000.upload.speed=256000
unphone7.menu.UploadSpeed.230400.windows.upload.speed=256000
unphone7.menu.UploadSpeed.230400=230400
unphone7.menu.UploadSpeed.230400.upload.speed=230400
unphone7.menu.UploadSpeed.460800.linux=460800
unphone7.menu.UploadSpeed.460800.macosx=460800
unphone7.menu.UploadSpeed.460800.upload.speed=460800
unphone7.menu.UploadSpeed.512000.windows=512000
unphone7.menu.UploadSpeed.512000.upload.speed=512000

unphone7.menu.DebugLevel.none=None
unphone7.menu.DebugLevel.none.build.code_debug=0
unphone7.menu.DebugLevel.error=Error
unphone7.menu.DebugLevel.error.build.code_debug=1
unphone7.menu.DebugLevel.warn=Warn
unphone7.menu.DebugLevel.warn.build.code_debug=2
unphone7.menu.DebugLevel.info=Info
unphone7.menu.DebugLevel.info.build.code_debug=3
unphone7.menu.DebugLevel.debug=Debug
unphone7.menu.DebugLevel.debug.build.code_debug=4
unphone7.menu.DebugLevel.verbose=Verbose
unphone7.menu.DebugLevel.verbose.build.code_debug=5

unphone7.menu.PartitionScheme.default=Default
unphone7.menu.PartitionScheme.default.build.partitions=default
unphone7.menu.PartitionScheme.no_ota=No OTA (Large APP)
unphone7.menu.PartitionScheme.no_ota.build.partitions=no_ota
unphone7.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
unphone7.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
unphone7.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
unphone7.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

unphone7.menu.EraseFlash.none=Disabled
unphone7.menu.EraseFlash.none.upload.erase_cmd=
unphone7.menu.EraseFlash.all=Enabled
unphone7.menu.EraseFlash.all.upload.erase_cmd=-e

