espressif/arduino-esp32/boards.txt
unphone9.upload.maximum_size=8323072
unphone9.upload.maximum_data_size=8716288
unphone9.upload.flags=
unphone9.upload.extra_flags=
unphone9.upload.use_1200bps_touch=false
unphone9.upload.wait_for_upload_port=false

unphone9.serial.disableDTR=false
unphone9.serial.disableRTS=false

unphone9.build.tarch=xtensa
unphone9.build.bootloader_addr=0x0
unphone9.build.target=esp32s3
unphone9.build.mcu=esp32s3
unphone9.build.core=esp32
unphone9.build.variant=unphone9
unphone9.build.board=unphone9

unphone9.build.usb_mode=1
unphone9.build.cdc_on_boot=1
unphone9.build.msc_on_boot=0
unphone9.build.dfu_on_boot=0
unphone9.build.f_cpu=240000000L
unphone9.build.flash_size=8MB
unphone9.build.flash_freq=80m
unphone9.build.flash_mode=dio
unphone9.build.boot=qio
unphone9.build.boot_freq=80m
unphone9.build.partitions=default_8MB
unphone9.build.defines=-DBOARD_HAS_PSRAM -DUNPHONE_SPIN=9
unphone9.build.loop_core=-DARDUINO_RUNNING_CORE=1
unphone9.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
unphone9.build.flash_type=qio
unphone9.build.psram_type=qspi
unphone9.build.memory_type={build.flash_type}_{build.psram_type}

unphone9.menu.USBMode.default=Hardware CDC and JTAG
unphone9.menu.USBMode.default.build.usb_mode=1
unphone9.menu.USBMode.hwcdc=USB-OTG (TinyUSB)
unphone9.menu.USBMode.hwcdc.build.usb_mode=0

unphone9.menu.CDCOnBoot.default=Enabled
unphone9.menu.CDCOnBoot.default.build.cdc_on_boot=1
unphone9.menu.CDCOnBoot.cdc=Disabled
unphone9.menu.CDCOnBoot.cdc.build.cdc_on_boot=0

unphone9.menu.MSCOnBoot.default=Disabled
unphone9.menu.MSCOnBoot.default.build.msc_on_boot=0
unphone9.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
unphone9.menu.MSCOnBoot.msc.build.msc_on_boot=1

unphone9.menu.DFUOnBoot.default=Disabled
unphone9.menu.DFUOnBoot.default.build.dfu_on_boot=0
unphone9.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
unphone9.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

unphone9.menu.UploadMode.default=UART0 / Hardware CDC
unphone9.menu.UploadMode.default.upload.use_1200bps_touch=false
unphone9.menu.UploadMode.default.upload.wait_for_upload_port=false
unphone9.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
unphone9.menu.UploadMode.cdc.upload.use_1200bps_touch=true
unphone9.menu.UploadMode.cdc.upload.wait_for_upload_port=true

unphone9.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
unphone9.menu.PartitionScheme.default.build.partitions=default
unphone9.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
unphone9.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
unphone9.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
unphone9.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
unphone9.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
unphone9.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
unphone9.menu.PartitionScheme.minimal.build.partitions=minimal
unphone9.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
unphone9.menu.PartitionScheme.no_ota.build.partitions=no_ota
unphone9.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
unphone9.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
unphone9.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
unphone9.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
unphone9.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
unphone9.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
unphone9.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
unphone9.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
unphone9.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
unphone9.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
unphone9.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
unphone9.menu.PartitionScheme.huge_app.build.partitions=huge_app
unphone9.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
unphone9.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
unphone9.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
unphone9.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
unphone9.menu.PartitionScheme.rainmaker=RainMaker
unphone9.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
unphone9.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728
unphone9.menu.PartitionScheme.max_app_8MB=Maximum APP (7.9MB APP No OTA/No FS)
unphone9.menu.PartitionScheme.max_app_8MB.build.partitions=max_app_8MB

unphone9.menu.CPUFreq.240=240MHz (WiFi)
unphone9.menu.CPUFreq.240.build.f_cpu=240000000L
unphone9.menu.CPUFreq.160=160MHz (WiFi)
unphone9.menu.CPUFreq.160.build.f_cpu=160000000L
unphone9.menu.CPUFreq.80=80MHz (WiFi)
unphone9.menu.CPUFreq.80.build.f_cpu=80000000L
unphone9.menu.CPUFreq.40=40MHz
unphone9.menu.CPUFreq.40.build.f_cpu=40000000L
unphone9.menu.CPUFreq.20=20MHz
unphone9.menu.CPUFreq.20.build.f_cpu=20000000L
unphone9.menu.CPUFreq.10=10MHz
unphone9.menu.CPUFreq.10.build.f_cpu=10000000L

unphone9.menu.UploadSpeed.921600=921600
unphone9.menu.UploadSpeed.921600.upload.speed=921600
unphone9.menu.UploadSpeed.115200=115200
unphone9.menu.UploadSpeed.115200.upload.speed=115200
unphone9.menu.UploadSpeed.256000.windows=256000
unphone9.menu.UploadSpeed.256000.upload.speed=256000
unphone9.menu.UploadSpeed.230400.windows.upload.speed=256000
unphone9.menu.UploadSpeed.230400=230400
unphone9.menu.UploadSpeed.230400.upload.speed=230400
unphone9.menu.UploadSpeed.460800.linux=460800
unphone9.menu.UploadSpeed.460800.macosx=460800
unphone9.menu.UploadSpeed.460800.upload.speed=460800
unphone9.menu.UploadSpeed.512000.windows=512000
unphone9.menu.UploadSpeed.512000.upload.speed=512000

unphone9.menu.DebugLevel.none=None
unphone9.menu.DebugLevel.none.build.code_debug=0
unphone9.menu.DebugLevel.error=Error
unphone9.menu.DebugLevel.error.build.code_debug=1
unphone9.menu.DebugLevel.warn=Warn
unphone9.menu.DebugLevel.warn.build.code_debug=2
unphone9.menu.DebugLevel.info=Info
unphone9.menu.DebugLevel.info.build.code_debug=3
unphone9.menu.DebugLevel.debug=Debug
unphone9.menu.DebugLevel.debug.build.code_debug=4
unphone9.menu.DebugLevel.verbose=Verbose
unphone9.menu.DebugLevel.verbose.build.code_debug=5

